import iphone13 from "./Accets/images/iphone13.jpg";
import iphone14 from "./Accets/images/iphon14.jpg";
import xiaomi12tPro from "./Accets/images/xiaomi12tPro.jpg";
import xiaomi12Pro from "./Accets/images/xiaomi12Pro.jpg";
import galaxyS21 from "./Accets/images/galaxyS21.jpg";
import galaxyS22Ultra from "./Accets/images/galaxyS22Ultra.jpg";
import galaxyZfold from "./Accets/images/galaxyZfold.webp";
import xiaomiPocoM4 from "./Accets/images/pocoM4.jpg";
import galaxyA51 from "./Accets/images/galaxyA51.jpg";
import partyBox from "./Accets/images/Mingo-Party-Box.png";
import airpodsPro from "./Accets/images/airpod-pros-removebg-preview.png";
import ps5 from "./Accets/images/Playstation-5.webp";
import xboxSeriesS from "./Accets/images/Xbox-Series-S.webp";
import ps4 from "./Accets/images/Playstation-4.png";
import xboxOneS from "./Accets/images/Xbox-one-s.png";
import asusRogStrix from "./Accets/images/asus-rog-strix.jpg";
import macbookAir2020 from "./Accets/images/macbook-air-2020.png";
import asusTufDashF15 from "./Accets/images/asus-tuf-dash-F15.png";
import asusGaming from "./Accets/images/asus-tuf-gaming-f15.png";
import zenBook from "./Accets/images/zenbook.jpg";
import thinkBook from "./Accets/images/lenovo-thinkbook.jpg";
export const allProducts = [
  //PHONES
  //PHONES
  //PHONES
  {
    id: 1,
    quantity: 1,
    category: "phones",
    title: "موبایل اپل مدل iPhone 13",
    price: 52439000,
    imageURL: iphone13,
    simcard: 2,
    camera: 12,
    ram: 4,
    screen: 6.1,
    storage: 256,
    system: 0,
    battery: 3000,
    positivePoints: [
      "طراحی زیبا و شیک با بدنه‌ای مقاوم و کاملا ضد آب",
      "صفحه نمایش OLED درخشان با پشتیبانی از HDR10 و Dolby Vision",
      "افزایش ظرفیت باتری و طول عمر آن نسبت به آیفون ۱۲",
      "اسپیکرهای استریوی باکیفیت با بلندی صدای زیاد",
      "پشتیبانی از تکنولوژی 5G",
      "مجهز شدن به برخی از ویژگی‌های آیفون ۱۲ پرو مکس در دوربین اصلی",
      "عملکرد فوق العاده رده بالا و عالی هر سه دوربین در شب و روز",
    ],
    negativePoints: [
      "عدم وجود تحول چندان چشمگیر و بزرگ نسبت به آیفون ۱۲",
      "عدم پشتیبانی از نرخ تازه سازی ۱۲۰ هرتز در صفحه نمایش",
      "سرعت شارژ کم‌تر نسبت به مدل‌های Pro",
      "ادامه وجود ناچ نمایشگر علیرغم کاهش اندازه آن",
    ],
    technicalCheck: `در حالی که بیشتر گوشی‌های اندروید حداکثر تا سه سال میزبان بروزرسانی‌های نرم‌افزاری هستند، اما گوشی آیفون ۱۳ حداقل تا ۵ سال میزبان بروزرسانی‌های iOS خواهد بود. بنابراین، اگر قصد خرید یک گوشی هوشمند با پشتیبانی طولانی‌مدتی داشته باشد، آیفون ۱۳ یکی از بهترین گزینه‌هاست.
با این وجود، اگر قصد خرید گوشی با پشتیبانی از نرخ تازه‌سازی ۱۲۰ هرتزی دارید، آیفون ۱۳ انتخاب خوبی نیست. این گوشی تنها پرچمدار سال ۲۰۲۱ میلادی‌ست که از نمایشگر ۶۰ هرتزی بهره می‌برد و همین موضوع به یکی از نقاط منفی آن تبدیل شده است. البته قدرت سخت‌افزاری و پنل نمایشگر فوق‌العاده می‌تواند این موضوع را جبران کند. اما هستند کسانی که واقعاً به دنبال نمایشگرهای ۱۲۰ هرتزی هستند و نمی‌توانند به سادگی آن را نادیده بگیرند.
آیفون ۱۳ از بسیاری جهات تغییر چندانی با نسل قبل ندارد. با این حال، بیشتر تغییرات و ارتقاء‌ها در داخل گوشی شکل گرفته‌اند. تراشه A15 Bionic یکی از بهترین و سریع‌ترین تراشه‌های دنیاست. دوربین ۱۲ مگاپیکسلی در هر شرایطی عملکرد شگفت‌انگیزی دارد و باتری با دوام بالا از جمله مهم‌ترین تغییرات آیفون ۱۳ محسوب می‌شوند. با این حال، اگر از آیفون ۱۲ استفاده می‌کنید، نیازی به ارتقاء آن ندارید. اگرچه آیفون ۱۳ ویژگی‌هایی دارد که واقعاً عالی‌ست، اما پیشرفت‌های آن دلیل خوبی برای ارتقاء از آیفون ۱۲ محسوب نمی‌شوند و همچنین در این گوشی از یک سنسور ۱۲ مگاپیکسل با تثبیت‌کننده تغییر سنسور استفاده شده که تقریباً در هر سناریویی عکس‌های شگفت‌انگیزی می‌گیرد. آیفون ۱۳ همچنان نسبت به رقبای اندرویدی خود در زمینه فیلمبرداری برتری مشخصی دارد. حالت سینماتیک نیز بسیار کاربردی و حرفه‌ای است , در ضمن، کیفیت ساخت آیفون ۱۳ فوق‌العاده است!`,
    Specifications: {
      cpu: { model: "پردازنده / Apple A15 Bionic", score: 9 },
      screen: { size: "سایز صفحه نمایش / 	6.1 اینچ", score: 8.8 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 8.7 },
      ram: { capacity: "رم / 4 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 12 مگاپیکسل", score: 9.1 },
      storage: { capacity: "حافظه داخلی / 256 گیگابایت", score: 8.9 },
      battery: { capacity: "باتری / 3240 میلی آمپر ساعت", score: 9 },
    },
    comments: [
      {
        star: 5,
        userName: "علیرضا",
        date: "پنجشنبه 5 آذر 1400",
        text: "یه روز میخرمت جذاب لنعتی !",
        like: 10,
        dislike: 1,
        positivePoints: ["باطری عالی", "دوربین فوق العاده"],
        negativePoints: ["خیلی گرونه"],
        reply: "انشالله عزیز 🙏🌹",
      },
            {
        star: 5,
        userName: "Reza",
        date: "یکشنبه 20 آبان 1400",
        text: "کاش قیمتا بیاد پایین و بتونیم بخریم... 🙂",
        like: 24,
        dislike: 5,
        reply: "انشالله 💖🙏",
      },
      {
        star: 4,
        userName: "محمد مهدی",
        date: "سه شنبه 5 آبان 1400",
        text: "من گرفتم فوق العادست... \n ممنون از سایت و ارسال سریع شما",
        like: 7,
        dislike: 2,
        positivePoints: ["صفحه نمایش خفن", "جذاب"],
        negativePoints: ["قیمت بالا"],
        reply: "مبارکتون باشه ",
      },
      {
        star: 3,
        userName: "آیدا رضایی",
        date: "جمعه 17 دی 1400",
        text: "من سفارش دادم ولی هنوز دستم نرسیده :(",
        like: 12,
        dislike: 4,
        reply: "صبور باشید فردا دستتون میرسه آیدای عزیز",
      },
    ],
  },
  {
    id: 2,
    quantity: 1,
    category: "phones",
    title: " موبایل سامسونگ Galaxy s21",
    price: 37199000,
    simcard: 2,
    camera: 12,
    ram: 8,
    storage: 256,
    screen: 6.2,
    system: 1,
    battery: 4000,
    imageURL: galaxyS21,
    technicalCheck: `در بخش طراحی به نظر من سامسونگ خوب عمل کرده. فریم دور گوشی روی قاب پشت گوشی آمده و روی آن سه دوربین زیر هم قرار گرفته است و فلش هم روی قاب پلاستیکی گوشی قرار دارد و جدا از دوربین ها است.
جنس بدنه پشتی پلاستیک است و این ویژگی خوبی نیست چون امکان خش پذیری آن افزایش پیدا می کند ولی قاب آن طراحی مات جذابی دارد و اثر انگشت هم کم روی آن می ماند.
دور گوشی فریم آلومینیمی است. زیر گوشی درگاه تایپ سی، خشاب سیم کارت، اسپیکر و میکروفون قرار دارد. لبه سمت راست آن دکمه پارو و دکمه کم و زیاد کردن صدا قرار دارد، بالای گوشی هم میکروفون قرار دارد و لبه سمت چپ هم چیزی وجود ندارد. دوربین اصلی سه لنز 12 مگاپیکسل که لنز اصلی است، 64 مگاپیکسل لنز تله فوتو و 12 مگاپیکسل لنز اولترا واید آن است.
عملکرد دوربین با S20 فرقی نداشته و دوربین اصلی آن عملکرد حدودا 10 درصد بهتر از S20 دارد. در نور خوب عکس های خوبی می توان ثبت کرد. شارپ نس آن خیلی زیاد نیست. اگر هم روی سوژه خود زوم کنید جزئیات خیلی خوب به نمایش گذاشته نمی شوند. داینامیک رنج آن معمولی و بعضی مواقع رو به پایین است. درشب هم کفیت آنچنانی ندارد.
لنز تلف فوتو هم خوب عمل می کند و سوژه از بک گراند راحت جدا می شود. لنز اولترا واید هم خوب عمل می کند.
فیلم برداری آن 8K با سرعت 24 فریم بر ثانیه است و کیفیت 4K هم سرعت 60 فریم بر ثانیه است. همه لنز ها قابلیت فیلم برداری 4K با سرعت 60 فریم بر ثانیه را ندارند و فقط با لنز اصلی می توان این کار را انجام داد. در کل این گوشی ارزش خرید را دارد`,
    positivePoints: [
      "کیفیت صدا قابل قبول",
      "دوربین پیشرفته",
      "بزرگترین باتری‌ها",
      "نمایشگر ۱۲۰ هرتزی AMOLED",
      "گواهی ضد آب IP68",
      "چیپست قدرتمند ۵ نانومتری",
    ],
    negativePoints: [
      "قاب پشتی پلاستیکی",
      "رزولوشن پایین‌تر دوربین‌ها نسبت به رقبا",
      "سرعت شارژ نه چندان بالا",
    ],
    Specifications: {
      cpu: {
        model: "پردازنده / Exynos 2100 & Qualcomm SM8350 Snapdragon 888 5G",
        score: 8.4,
      },
      screen: { size: "سایز صفحه نمایش / 	6.2 اینچ", score: 8.5 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 8.7 },
      ram: { capacity: "رم / 8 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 12 مگاپیکسل", score: 8.8 },
      storage: { capacity: "حافظه داخلی / 256 گیگابایت", score: 8 },
      battery: { capacity: "باتری / 4000 میلی آمپر ساعت", score: 8.2 },
    },
    comments: [
      {
        star: 5,
        userName: "MohammadReza",
        date: "پنجشنبه 6 آذر 1400",
        text: "خوشگله",
        like: 5,
        dislike: 1,
        positivePoints: ["ضد آب", "کیفیت صداش خفنه"],
        negativePoints: ["دیر شارژ میشه"],
        reply: "چشمات خوشگل میبینه 🙏🌹",
      },
      {
        star: 3,
        userName: "سارا رحمانی",
        date: "چهارشنبه شنبه 3 آبان 1400",
        text: "چندروزه سفارش دادم ولی به دستم نرسیده...",
        like: 3,
        dislike: 2,
        positivePoints: [ "جذاب"],
        negativePoints: ["قیمت بالا"],
        reply: "حتما رسیدگی میشه عزیز ",
      },
      {
        star: 5,
        userName: "Iliya",
        date: "شنبه 20 بهمن 1400",
        text: "ممنون بابت اینکه قسمت بررسی فنی هم گذاشتین :)",
        like: 16,
        dislike: 4,
        reply: "قربان شما ایلیا جان",
      },
    ],
  },
  {
    id: 3,
    quantity: 1,
    category: "phones",
    title: "موبایل اپل مدل iPhone 14",
    price: 48000000,
    simcard: 2,
    camera: 12,
    screen: 6.1,
    ram: 6,
    storage: 512,
    system: 0,
    battery: 3000,
    imageURL: iphone14,
    technicalCheck: `آیفون ۱۴ پرو با نوآوری‌های سال ۲۰۲۲ اپل از راه رسید تا همانند نسل قبل به یکی از پرفروش‌ترین گوشی‌های بازار جهان بدل شود. اپل امسال نوآوری‌های خود را به دو عضو حرفه‌ای خانواده آیفون ۱۴ یعنی مدل‌های پرو و پرو مکس محدود کرده است. چیپ پیشرفته A16 Bionic، داینامیک آیلند، نمایشگر همیشه روشن و دوربین اصلی ۴۸ مگاپیکسلی، ویژگی‌های جدیدی هستند که از آنها صحبت می‌کنیم. بنابراین برای نخستین بار، آیفون ۱۴ و آیفون ۱۴ پلاس از همه‌نظر پایین‌تر از مدل‌های پرو قرار می‌گیرند و برای دستیابی به جدیدترین ویژگی‌ها باید حتما مدل‌های پرو را بخرید. از این‌ها که بگذریم، آیفون ۱۴ پرو با قیمت پایه ۱۰۰۰ دلاری را پیش رو داریم که پیشرفته‌ترین گوشی اپل محسوب می‌شود. مثل هر سال با چیپ قوی‌تر، نمایشگر بهتر و دوربین پیشرفته‌تر روبرو هستیم. همچنین برای نخستین بار، آیفون‌ها توانایی برقراری ارتباط ماهواره‌ای را نیز به‌دست آورده‌اند اما از آنجا که این قابلیت هنوز بسیار محدود است، در مورد آن صحبت نمی‌کنیم. حتی وضعیت فروش آیفون ۱۴ نیز در ایران در هاله‌ای از ابهام قرار دارد و هنوز شاهد فروش رسمی آن نیستیم. مهم‌ترین تفاوت طراحی آیفون ۱۴ پرو نسبت به نسل قبل به حذف ناچ برمی‌گردد. ناچ معروف آیفون که به‌سرعت راه خود را به دنیای اندروید هم باز کرد، حالا به کپسول عریضی تبدیل شده که اپل آن را داینامیک آیلند (Dynamic Island) یا جزیره پویا می‌نامد. در واقع اپل تنها شرکتی است که حتی حفره داخل نمایشگر را نیز به یک برند خاص تبدیل کرده است.
اپل می‌گوید داینامیک آیلند، نحوه تعامل شما با گوشی را متحول می‌کند. این کپسول که از دوربین سلفی و تجهیزات فیس‌تایم تشکیل شده، ابعاد ثابتی ندارد و در شرایط مختلف، تغییر می‌کند. به‌عنوان مثال اگر اپلیکیشن زمان‌سنج را فعال کرده و به صفحه هوم برگردید، تایمر در کنار کپسول نمایش داده می‌شود. اپ‌های پخش محتوای صوتی مانند پادکست، اپل موزیک یا اسپاتیفای نیز اطلاعات موزیک در حال پخش را در کنار ناچ به نمایش می‌گذارند. اگر این جزیره پویا را لمس کنید، اپ مربوط به آن باز می‌شود و با لمس طولانی می‌توانید ویجت بزرگ‌تری را برای تعامل با اپلیکیشن در اختیار داشته باشید. شکی نیست که آیفون‌ها همیشه بهترین نمایشگر دنیای موبایل را در اختیار داشته‌اند. آیفون ۱۴ پرو از نمایشگر ۶.۱ اینچی سوپر رتینا XDR با پنل اولد بهره می‌برد که با رزولوشن ۱۱۷۹ در ۲۵۵۶ پیکسل، محتوا را با تراکم ۴۶۰ پیکسل در هر اینچ به نمایش می‌گذارد. تا اینجا تفاوتی بین این نمایشگر و نسل قبل وجود ندارد اما امسال برای نخستین بار قابلیت نمایشگر همیشه روشن به دنیای آیفون آمده است.  آیفون‌ها همیشه از قدرتمندترین گوشی‌های دنیای موبایل بوده‌اند و آیفون ۱۴ پرو نیز از این قاعده مستثنی نیست. قلب تپنده این گوشی چیپ A16 Bionic است. این تراشه ۴ نانومتری از پردازنده ۶ هسته‌ای با ۲ هسته قدرتمند و ۴ هسته کم‌مصرف استفاده می‌کند که حداکثر فرکانس آن‌ها به‌ترتیب به ۳.۴۶ و ۲.۰۲ گیگاهرتز می‌‎رسد. اپل ادعا می‌کند که پردازنده A16 Bionic نسبت به قبل ۲۰ درصد مصرف انرژی کم‌تری دارد و همزمان نسبت به رقبا ۴۰ درصد قدرتمندتر است. کوپرتینیویی‌ها پهنای باند پردازنده گرافیکی ۵ هسته‌ای این گوشی را نیز ۵۰ درصد بیشتر کرده‌اند. این گوشی در نسخه‌های مختلفی با ۱۲۸، ۲۵۶، ۵۱۲ یا ۱۰۲۴ گیگابایت حافظه داخلی قابل خریداریست و میزان حافظه رم در تمام نسخه‌ها برابر با ۶ گیگابایت است. آیفون ۱۴ پرو قوی‌ترین گوشی دنیای موبایل است و ایراد خاصی نمی‌توان به آن گرفت. یکپارچگی بین سخت‌افزار و نرم‌افزار در بالاترین سطح ممکن، مجموعه دوربین‌های فوق‌العاده، نمایشگر بی‌رقیب و شارژدهی خوب، بهترین تجربه ممکن از یک گوشی هوشمند را در اختیار شما قرار می‌دهند. این‌ها بخش شیرین ماجراست.
در بخش تلخ داستان، باید به این مسئله اشاره کرد که اختلاف بین آیفون‌های پرو و معمولی در این نسل به طرز معنادار و برجسته ای افزایش پیدا کرده و حالا برای دستیابی به بهترین‌ها، باید حتما مدل‌های پرو را خریداری کنید. در واقع در سال ۲۰۲۲ آیفون ۱۴ و ۱۴ پلاس را نمی‌توان پرچمدار تلقی کرد، چون از همه‌نظر در سطح پایین‌تری نسبت به مدل‌های پرو قرار می‌گیرند. باید دید در سال‌های آینده استراتژی اپل چه تغییری می‌کند.`,
    positivePoints: [
      "صفحه‌نمایش HDR و بسیار دقیق",
      "اسپیکرهای استریو با صدای رسا",
      'بهبود چشم‌گیر پایداری عملکرد',
      'پشتیبانی نرم‌افزاری عالی',
    ],
    negativePoints: [
      'نمایشگر ۶۰ هرتزی',
      'فقدان درگاه USB-C',
      'سرعت شارژ کمتر از رقبا',
      'عرضه بدون شارژر',
    ],
    Specifications: {
      cpu: {
        model: "پردازنده / Apple A15 Bionic",
        score: 9,
      },
      screen: { size: "سایز صفحه نمایش / 	6.1 اینچ", score: 10 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 9 },
      ram: { capacity: "رم / 6 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 12 مگاپیکسل", score: 9 },
      storage: { capacity: "حافظه داخلی / 512 گیگابایت", score: 10 },
      battery: { capacity: "باتری / 3279 میلی آمپر ساعت", score: 9.5 },
    },
    comments: [
      {
        star: 4,
        userName: "Aqa Saman",
        date: "دوشنبه 2 آذر 1400",
        text: "کاش رجیستر میشد ...",
        like: 21,
        dislike: 1,
        positivePoints: ["قد و بالای تو رعنا رو بنازم !"],
        negativePoints: ["گران"],
        reply: "انشالله که بشه 🌹",
      },
      {
        star: 5,
        userName: "O-O",
        date: "شنبه 1 دی 1400",
        text: "ددی همین امروز برام سفارش داد :)",
        like: 2,
        dislike: 15,
        positivePoints: ["صفحه نمایش خفن", "جذاب", "قدرتمند"],
        negativePoints: ["قیمت بالااااا"],
        reply: "ای جان",
      },
            {
        star: 5,
        userName: "آقا علی",
        date: "یکشنبه 20 آبان 1400",
        text: "میخرم به زودی 🙂",
        like: 12,
        dislike: 5,
        reply: "درخدمت شما هستیم💖🙏",
      },
      {
        star: 5,
        userName: "محسن محمدی",
        date: "سه شنبه 5 اسفند 1400",
        text: "چه دلبریه ...",
        like: 12,
        dislike: 0,
        reply: "...",
      },
    ],
  },
  {
    id: 4,
    quantity: 1,
    category: "phones",
    title: "موبایل شیائومی مدل Poco M4",
    price: 6799000,
    simcard: 2,
    camera: 50,
    ram: 8,
    storage: 256,
    screen: 6.63,
    system: 1,
    battery: 5000,
    imageURL: xiaomiPocoM4,
    technicalCheck: `باید اعتراف کنیم که پوکو ام 4 پرو 5G بسیار جذاب است. قاب پشتی نسبتاً منحنی به همراه پوشش پلاستیکی مات و ترکیب رنگ خاکستری تیره در کنار برآمدگی مشکی رنگ دوربین و محل درج لوگوی پوکو (خیره‌کننده ولی عجیب)، بی‌شک چشم‌نواز خواهند بود. می‌توانیم بگوییم که پوشش مات به کار رفته روی قاب پشتی کیفیت بسیار بالایی دارد زیرا وقتی آن را لمس می‌کنید احساس فوق‌العاده‌ای به شما منتقل خواهد کرد و این‌گونه حس خواهید کرد که به جای پلاستیک، در حال لمس شیشه هستید.
پنل پشتی خاکستری تیره بسیار دوست‌داشتنی است ولی در عین حال اثرات انگشت و آلودگی‌ها را به سرعت جذب می‌کند و پس از گذشت تنها چند دقیقه کثیف می‌شود. اگر نمی‌خواهید این اتفاق رخ دهد، شاید بهتر باشد سراغ نمونه‌های آبی یا زرد رنگ این موبایل بروید که آنها هم در بالای قاب پشتی خود قسمت مشکی برآمده را دارند.
به غیر از نمایان بودن هویت پوکو در قاب پشتی، Poco M4 Pro 5G در قاب شیشه‌ای و جلویی خود از محافظ گوریلا گلس بهره می‌برد و فریم و قاب آن پلاستیکی هستند. این موبایل تأییدیه رسمی ضد خاک و قطرات آب IP53 دارد که یک عایق عالی به شمار می‌رود. این یعنی پوکو ام 4 پرو 5G مشکلی با آب و هوای مرطوب شهرهای کنار دریا و یا آب و هوای بارانی ندارد ولی نباید در زیر آب فرو برود.
نمای جلویی محل جای‌گیری صفحه نمایش 6.6 اینچی است که در مقایسه با نمایشگر 6.5 اینچی پوکو M3 Pro 5G به میزان 0.1 اینچ بزرگتر شده است. این پنل جدید در بالای خود از همان حفره سیاه رنگ برای حضور یافتن دوربین سلفی بهره می‌برد ولی این‌بار با پشتیبانی از فضای رنگی DCI-P3 و موتور حساس به لمس 240 هرتزی، بروزتر شده است. نمایشگر گوشی مورد بحث ما از نرخ بازسازی 90 هرتزی پویا، فضای رنگی DCI-P3 و موتور حساس به لمس 240 هرتزی پشتیبانی می‌کند. Poco M3 Pro 5G هم نرخ نوسازی 90 هرتزی داشت اما موتور حساس به لمس آن 180 هرتزی و با فضای رنگی sRGB سازگار بود.
در این تلفن همراه خبری از پشتیبانی از کیفیت تصاویر HDR نیست هرچند انتظار چنین چیزی هم نمی‌رفت.
شیائومی عنوان کرده که روشنایی معمول این محصولش به 450 نیت خواهد رسید. در زمانی که خودتان به صورت دستی روشنایی را تنظیم می‌کنید، مقدار آن به 410 نیت می‌رسد و وقتی هم که حالت اتوماتیک در زیر نور خورشید را روشن کردید، رکورد 510 نیتی ثبت خواهد شد. در هر دو حالت، قسمت‌های مشکی عمق زیادی دارند تا کنتراست نهایی ثبت شده 1500:1 باشد.
حداقل روشنایی ثبت شده در قسمت‌های سفید رنگ هم تنها 1.3 نیت بود.
رابط کاربری MIUI مخصوص گوشی‌های پوکو، دو گزینه برای نرخ بازسازی دارد که یکی High با سرعت 90 هرتزی و دیگری Standard با سرعت 60 هرتزی است. مورد اول را بعضاً پویا هم می‌نامند زیرا با توجه به محتوای در حال پخش، به طور اتوماتیک میان سرعت‌های 50، 60 و 90 هرتزی سوئیچ می‌کند.
این‌گونه حدس می‌زنیم که هنگام اسکرول کردن در رابط کاربری سرعت نرخ بازسازی به 90 هرتز برسد و وقتی هم کاری صورت نمی‌گیرد، سرعت آن به 50 هرتز کاهش یابد. همین اتفاق برای محتواهای ثابت در اپلیکیشن‌های سازگار نیز رخ خواهد داد. سرعت 60 هرتزی هم در بازی‌ها و نرم‌افزارهای پخش آنلاین فیلم و استریمینگ فعال خواهد شد. متأسفانه نمی‌توانیم این قضایا را تأیید کنیم زیرا نشانگر اختصاصی نرخ بازسازی، حتی وقتی عکس نمایش داده می‌شود نیز همیشه سرعت 90 هرتزی را نشان می‌دهد. تنها استثنائات قائل شده، سرعت 60 هرتزی برای نرم‌افزارهای مدیریت فایل‌ها، بازی‌ها و برخی از اپلیکیشن‌های پخش فیلم نظیر Mi Video و نتفلیکس می‌باشد. پوکو ام 4 پرو 5G از جدیدترین نسخه رابط کاربری MIUI یعنی شماره 12.5 مخصوص گوشی‌های پوکو بهره می‌برد. دوازدهمین ورژن پوسته نرم‌افزاری محصولات شیائومی مدتی است منتشر شده و اگرچه بر پایه اندروید 11 می‌باشد ولی نمی‌توان به راحتی متوجه این نکته شد. لانچر پوکو دارای تم سیستمی و آیکون‌های متفاوت است ولی اگر دوست داشتید، می‌توانید ظاهرش را آن‌طور که می‌خواهید، تغییر دهید. Poco M4 Pro 5G یک گوشی همه چیز تمام است و دقیقاً همان‌گونه عمل می‌کند که از آن انتظار داریم. به خاطر نمایشگر LCD با نرخ بازسازی 90 هرتزی، سیستم عامل آن روان بوده و می‌تواند در صورت نیاز برخی از بازی‌ها را اجرا کند. تصاویر خوبی هم می‌گیرد و صداها را با کیفیت استریو پخش می‌کند و دوام باتری طولانی مدتی داشته و سرعت شارژش هم زیاد است.`,
    positivePoints: [
      "شیوه طراحی جذاب، ضد قطرات آب و رنگ‌بندی کامل",
      'صفحه نمایش LCD با نرخ بازسازی 90 هرتزی و کنتراست عالی',
      "دوام باتری طولانی مدت و سرعت شارژ زیاد",
      'عملکرد قابل‌قبول و داغ نشدن دستگاه',
      'کیفیت مناسب تصاویر و ویدیوهای ضبط شده',
      'کیفیت قابل‌قبول تصاویر پرتره علی‌رغم نبودن لنز تشخیص عمق',
      'قیمت مناسب'
    ],
    negativePoints: [
     'تأثیر منفی نرخ بازسازی 90 هرتزی روی عملکرد پردازنده گرافیکی',
      'کیفیت معمولی و رو به پایین اسپیکرها',
      'نداشتن لنز مکرو و ناتوانی در ضبط ویدیوهای 4K',
      'پیشرفت نه چندان قابل‌توجه در زمینه عملکرد نسبت به Poco M3 Pro 5G',
    ],
    Specifications: {
      cpu: {
        model: "پردازنده / Mediatek Helio G96 / Mali-G57 MC2",
        score: 9,
      },
      screen: { size: "سایز صفحه نمایش / 	6.63 اینچ", score: 8 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 8 },
      ram: { capacity: "رم / 8 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 50 مگاپیکسل", score: 9 },
      storage: { capacity: "حافظه داخلی / 128 گیگابایت", score: 7.5 },
      battery: { capacity: "باتری / 5000 میلی آمپر ساعت", score: 9 },
    },
    comments: [
      {
        star: 5,
        userName: "آقا محمد",
        date: "شنبه 2 اسفند 1400",
        text: "اگه دنبال یه گوشی مقرون به صرفه هستید بهترین انتخاب هست",
        like: 45,
        dislike: 10,
        positivePoints: ["باتری عالی", "صفحه نمایش عالی", "دوربین قوی"],
        negativePoints: ["اسپیکر ضعیف"],
        reply: "ممنون که تجربه خودتون رو باما درمیون گذاشتید ❤🌹",
      },
      {
        star: 5,
        userName: "سارینا",
        date: "سه شنبه 17 دی 1400",
        text: "مقرون به صرفه و اقتصادی هست پیشنهاد میکنم عزیزان",
        like: 15,
        dislike: 1,
        positivePoints: ["قدرت بالا"],
        negativePoints: ["یکم سنگینه"],
        reply: "سپاس از نظر ارزشمند شما 🌹",
      },
      {
        star: 4,
        userName: "احسان حبیبی",
        date: "یکشنبه 20 آبان 1400",
        text: "من سفارش دادم و سریع هم به دستم رسید تشکر از سایت خوب شما",
        like: 12,
        dislike: 4,
        reply: "مبارکتون باشه احسان جان",
      },
    ],
  },
  {
    id: 5,
    quantity: 1,
    category: "phones",
    title: "موبایل سامسونگ Galaxy A51",
    price: 8200000,
    screen: 6.5,
    simcard: 2,
    camera: 48,
    ram: 8,
    storage: 256,
    system: 1,
    battery: 4000,
    imageURL: galaxyA51,
    technicalCheck: `طبق آمارهای ارائه شده توسط موسسه‌های تحقیقاتی، Galaxy A51 تا اینجای سال 2020، پرفروش‌ترین گوشی اندرویدی جهان است. امروز با بررسی گلکسی A51 سامسونگ قصد داریم دلیل این موضوع را کشف کنیم.
سامسونگ در سال 2019 گوشی‌های سری گلکسی A را دستخوش تغییراتی اساسی کرد، اما شاید خوشبین‌ترین طرفدار این برند هم انتظار اینچنین استقبالی را از گوشی‌های نسل جدید این سری نداشت. گوشی‌های کهکشانی اقتصادی و میان‌رده A در سال گذشته فروش بسیار خوبی در سراسر جهان داشتند و همین فروش خوب نشان‌دهنده این بود که سامسونگ مسیر درستی را برای گوشی‌های میان‌رده خود در پیش گرفته است.
سامسونگ در اوایل سال 2019 گوشی گلکسی A50 را معرفی و راهی بازار کرد. A50 یکی از بهترین گوشی‌های اقتصادی سامسونگ به حساب می‌آمد که به دلیل ارائه امکانات خوب، قیمت مناسب و در عین حال طراحی جذاب با استقبال خوبی از سمت کاربران روبه‌رو شد. این موضوع کار را برای جانشین آن بسیار سخت می‌کرد. با این حال، سامسونگ با معرفی گلکسی A51 ثابت کرد که چرا عنوان “پرفروشترین برند گوشی” در جهان را به خود اختصاص داده است. A51 از نظر مشخصات سخت‌افزاری و حتی طراحی تفاوت چندانی با برادر بزرگتر خود ندارد. اما ظاهراً همین تغییرات کوچک کافیست تا این گوشی حتی از نسل قبل خود نیز موفق‌تر عمل کند و به پرفروش‌ترین گوشی اندرویدی بازار تبدیل شود. در بررسی گلکسی A51 سامسونگ تصمیم داریم تا نگاه دقیق‌تری داشته باشیم به مشخصات این گوشی و ببینیم که چه مشخصه‌هایی آن را به این سطح از محبوبیت در بازار رسانده است. پس با ما همراه باشید. سامسونگ مانند سال گذشته این گوشی را از ترکیب شیشه و پلاستیک طراحی کرده است. قاب پشت و فریم دور این گوشی پلاستیکی است با این تفاوت که خطوط مورب و هاشور مانندی در قاب پشتی آن طراحی شده که در زوایای مختلف و شرایط نوری متفاوت جلوه‌های رنگی متنوع و زیبایی خواهد داشت.
در سمت چپ بالای قاب پشت یک محفظه نسبتاً بزرگ مستطیلی برای دوربین‌ها در نظر گرفته شده است. در ستون سمت چپ سه سنسور دوربین و در ستون سمت راست این قاب فلش LED و یک سنسور دوربین دیگر جای گرفته‌اند. برآمدگی این قسمت از قاب نسبت به برجستگی قاب دوربین گوشی‌های مشابه آنقدر محسوس نیست و قرار دادن آن بر روی سطح صاف و کار کردن با گوشی را با  مشکل مواجه نخواهد کرد. اما از آنجاییکه قاب دستگاه پلاستیکی است، به شدت مستعد جذب خراش بوده، از همین رو بهتر است از قاب محافظی که درون جعبه گوشی در نظر گرفته شده، استفاده کنید. نمایشگر و پنل جلوی گوشی با پوشش گوریلا گلس 3 محافظت می‌شوند و این یعنی این یعنی مقاومت نمایشگر در مقایسه با قاب پشتی در برابر خط و خراش بیشتر است، البته نه در آن حدی که به طور کل قید استفاده از محافظ و گلس را بزنید. در مقایسه با A50 حاشیه‌های اطراف نمایشگر A51 باریک‌تر شده‌اند و دوربین سلفی از ناچ به حفره‌ای دورن نمایشگر منتقل شده است. گلکسی A51 سامسونگ یکی از جمع و جورترین و خوش‌دست‌ترین گوشی‌هایی است که در این بازه قیمتی راهی بازار شده است. این گوشی به‌ طرز جالبی سبک‌تر و باریک‌تر از رقیبان خود طراحی شده و استفاده طولانی مدت از آن حتی برای دستان ظریف نیز خسته‌کننده نخواهد بود. وجود جک 3.5 میلیمتری هدفون، شیار اختصاصی کارت حافظه و قاب محافظ در جعبه نیز از نکات مثبتی است که سامسونگ در طراحی این دستگاه آنها را مد نظر داشته است. گلکسی A51 سامسونگ از چیپست 10 نانومتری اگزینوس 9611 به عنوان مغز متفکر بهره می‌برد. این تراشه دارای پردازنده هشت هسته‌ای (4 هسته 2.3 گیگاهرتزی Cortex-A73 و 4 هسته 1.7 گیگاهرتزی Cortex-A53) با پردازنده گرافیکی Mali-G72 MP3 بهره می‌برد. سامسونگ این گوشی را با 4 پیکربندی با 4، 6 و 8 گیگابایت حافظه رم و 64 و 128 گیگابایت حافظه ذخیره‌سازی از نوع UFS 2.0 راهی بازار کرده است. خوشبختانه در تمامی نسخه‌های این گوشی امکان افزایش حافظه از طریق شیار اختصاصی microSD نیز در نظر گرفته شده است.
در مقایسه با چیپست اگزینوس 9610 که در گوشی A50 استفاده شده، در 9611 تفاوت چشمگیری مشاهده نمی‌شود. هسته‌های پردازنده، فرکانس آنها و حتی پردازنده گرافیکی آنها نیز یکی است. به نظر می‌رسد تفاوت تفاوت اعمال شده در دوربین باشد که امکان پشتیبانی از سنسورهای با رزولوشن بالاتر در نظر گرفته شده است. با این حال، در تست‌های بنچمارک در بررسی گلکسی A51 سامسونگ امتیازاتی که توسط این گوشی کسب شد، تقریباً در تمامی تست‌ها بهتر از نسل قبلی خود بود. A51 یک گوشی میان‌رده است و این یعنی در انجام کارهای روزمره مانند استفاده از شبکه‌های اجتماعی، عکاسی، فیلمبرداری، یوتیوب، گشتن در وبسایت‌ها، برقراری تماس، ارسال پیام، مطالعه و … به هیچ وجه شما را ناامید نخواهد کرد. البته امکان استفاده از این گوشی برای انجام کارهای سنگین و چالشی‌تر نیز در نظر گرفته شده. به عنوان مثال در طول بررسی گلکسی A51 سامسونگ ما توانستیم جدیدترین و سنگین‌ترین بازی‌های موبایلی مانند آسفالت 9 یا PUBG Mobile را بر روی آن نصب کنیم و با موفقیت بازی کنیم.`,
    positivePoints: [
      'ارگونومی و وزن مناسب',
      'نمایشگر AMOLED با روشنایی خوب و رنگ‌های چشم‌نواز',
      'عرضه به‌صورت پیش‌فرض با اندروید ۱۰ و رابط‌کاربری One UI 2.0',
    ],
    negativePoints: [
      'پردازنده‌ی ضعیف‌تر از رقبا',
    ],
    Specifications: {
      cpu: {
        model: "پردازنده / Mediatek Helio G96 / Mali-G57 MC2",
        score: 8.5,
      },
      screen: { size: "سایز صفحه نمایش / 	6.63 اینچ", score: 9.5 },
      speaker: { model: "اسپیکر / مونو", score: 8 },
      ram: { capacity: "رم / 6 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 48 مگاپیکسل", score: 8 },
      storage: { capacity: "حافظه داخلی / 128 گیگابایت", score: 8 },
      battery: { capacity: "باتری / 4000 میلی آمپر ساعت", score: 9.5 },
    },
    comments: [
      {
        star: 5,
        userName: "علی بیرانوند",
        date: "شنبه 26 بهمن 1400",
        text: "من برای روز پدر سفارش دادم گوشی فوق العاده ای هست... تشکر از شما✨",
        like: 20,
        dislike: 1,
        positivePoints: ["جذابه", "باتریش خوبه"],
        reply: "مبارک باشه علی جان به خوشی استفاده کنن انشالله ❤🌹",
      },
      {
        star: 4,
        userName: "الهام جلیل وند",
        date: "دوشنبه 5 خرداد 1400",
        text: "من سفارش دادم هنوز به دستم نرسیده :(",
        like: 10,
        dislike: 3,
        reply: "بابت تاخیر از شما معذرت میخوایم مرسی که صبور هستید 💖",
      },
      {
        star: 5,
        userName: "آقا علی",
        date: "یکشنبه 20 آبان 1400",
        text: "میخرم به زودی 🙂",
        like: 12,
        dislike: 5,
        reply: "درخدمت شما هستیم💖🙏",
      },
    ],
  },
  {
    id: 19,
    quantity: 1,
    category: "phones",
    title: "موبایل شیائومی مدل 12T Pro",
    price: 26730000,
    imageURL: xiaomi12tPro,
    simcard: 2,
    camera: 200,
    ram: 12,
    storage: 256,
    screen: 6.67,
    system: 1,
    battery: 5000,
    positivePoints: [
      "عملکرد خوب دوربین‌ها",
      "طراحی قابل قبول",
      "صفحه نمایش OLED با نرخ نوسازی ۱۲۰ هرتز",
      "شارژ سریع فوق‌العاده",
      "اسپیکرهای باکیفیت",
      "برخورداری از تراشه اسنپ دراگون ۸ پلاس نسل ۱",
    ],
    negativePoints: [
      "انتظار داشتیم باتری عملکرد بهتری داشت",
      "بدنه و فریم پلاستیکی است",
    ],
    technicalCheck: `قیمت شیائومی 12t pro باعث شده که این گوشی شیائومی ظاهری کلاسیک و نسبتا ساده داشته باشد. شیائومی 12t pro به شکلی طراحی شده که قاب پشتی آن کمی خمیده باشد. اتفاقی که باعث شده گوشی راحت‌تر در دست قرار بگیرد. باید به این موضوع اشاره کنیم که گوشی شیائومی 12t pro در ابعاد ۱۶۳٫۱ در ۷۵٫۹  در ۸٫۹ میلی‌متر ساخته شده و وزن آن ۲۰۵ گرم است. با محصولی سروکار دارید که راحت در دست قرار می‌گیرد و وزن نسبتا زیادی دارد. قاب پشتی این گوشی به صورت مات طراحی شده و کثیفی را خیلی نشان نمی‌دهد. روی قاب پشتی ماژول دوربین را مشاهده می‌کنید که به صورت مستطیلی شکل طراحی شده است. این طراحی ماژول دوربین پشت را در سایر گوشی‌های شیائومی ۱۲ هم دیده بودیم. روی قاب جلوی گوشی صفحه نمایشی بزرگ را مشاهده می‌کنید که ناچ حفره‌ای دارد که دوربین سلفی داخل آن قرار گرفته است. صفحه نمایش حاشیه‌های بسیار کمی هم دارد و فضای زیادی را برای تماشای محتوای محتلف پیش روی کاربران قرار می‌دهد. روی لبه سمت راست گوشی گوشی شیائومی 12t pro دکمه‌‌های تنظیم صدا و دکمه پاور را به همراه حسگر تشخیص اثر انگشت مشاهده می‌کنید. روی لبه سمت چپ گوشی هم دکمه‌ای دیده نمی‌شود. روی لبه بالای گوشی یکی از اسپیکرهای این گوشی را مشاهده می‌کنید. فرستنده IR و میکروفن هم روی این لبه دیده می‌شود. روی لبه پایین گوشی هم محل قرار گرفتن سیم‌کارت و کارت حافظه، پورت شارژ، میکروفن و اسپیکر را خواهید دید. از دیگر مشخصات شیائومی 12t pro باید به صفحه نمایش اشاره کنیم. روی این گوشی از صفحه نمایشی ۶٫۶۷ اینچی AMOLED استفاده شده که وضوح تصویر ۱۲۲۰ در ۲۷۱۲ پیکسل را پیش روی کاربران قرار می‌دهد. صفحه نمایشی که تراکم پیکسلی آن ۴۴۶ پیکسل در هر اینچ خواهد بود.  باید به این موضوع اشاره کنیم که صفحه نمایشی بسیار درخشان برای این گوشی در نظر گرفته شده است. صفحه نمایشی که می‌تواند در حالت معمولی تا ۵۰۰ نیت روشنایی تولید کند و در حالت خودکار هم میزان روشنایی آن به ۹۰۰ نیت می‌رسد.  با صفحه نمایش این گوشی به خوبی می‌توانید در محیط‌های خارج از خانه کار کنید و در زیر نور آفتاب هم مشکلی با این موضوع نخواهید داشت. صفحه نمایش این گوشی از تکنولوژی‌هایی مانند HDR 10+ و دالبی ویژن پشتیبانی می‌کند و از رنگ‌های ۱۲ بیتی پشتیبانی می‌کند. از دیگر ویژگی‌های گوشی شیائومی 12 تی پرو می‌توانیم به نرخ نوسازی ۱۲۰ هرتز صفحه نمایش آن اشاره کنیم. این اتفاق باعث می‌شود که بتوانید بازی‌های روز را با نرخ فریم بالاتری تجربه کنید. البته که می‌توانید نرخ نوسازی صفحه نمایش را روی ۶۰ هرتز هم قرار دهید. 
    در زمان خرید شیائومی 12 تی پرو باید به این موضوع توجه داشته باشید که این گوشی به باتری ۵۰۰۰ میلی‌آمپر ساعتی مجهز شده است. این میزان باتری برای استفاده‌های روزانه کاملا مناسب خواهد بود و به خوبی شما را همراه می‌کند. از ویژگی‌های جذابی که باعث شده شیائومی 12t pro بسیار مورد توجه قرار بگیرد، برخورداری از شارژر ۱۲۰ وات است. شارژری که شیائومی نام آن را هایپرشارژ گذاشته است. سرعت شارژ کردن باتری گوشی شیائومی 12t pro بسیار عالی است و در مدت زمان کمی می‌توانید باتری را شارژ کنید. در مدت زمان ۳۰ دقیقه می‌توانید باتری این گوشی را کاملا شارژ کنید. بد نیست به این موضوع هم اشاره کنیم که این گوشی شارژ سریع‌تری هم دارد که Boost Charge نام دارد. با فعال کردن این ویژگی می‌توانید چند دقیقه‌ای گوشی را سریع‌تر شارژ کنید. با فعال کردن این گزینه می‌توانید کل ظرفیت باتری را در مدت زمان ۲۳ دقیقه شارژ کنید.   یکی دیگر از ویژگی‌هایی که باعث شده قیمت شیائومی 12t pro بسیار عالی به نظر می‌رسد، امکاناتی است که برای اسپیکر این گوشی در نظر گرفته شده است. شیائومی ۱۲ تی پرو از اسپیکرهای استریو استفاده می‌کند. یک اسپیکر روی لبه بالا و یک اسپیکر هم روی لبه پایین قرار گرفته است. این اسپیکرها توسط هارمن کاردن تقویت شده‌اند و استاندارد دالبی اتموس بهره می‌برند. شیائومی ۱۲ تی پرو یکی از بهترین اسپیکرها در بین گوشی‌های هوشمند را دارد. در زمان خرید شیائومی 12 تی پرو به این موضوع توجه داشته باشید که این گوشی قاتل پرچم‌دار فوق العاده ارزشمندی است. قیمت شیائومی 12t pro هم باعث شده که این محصول ارزش خرید بالایی پیدا کند. با محصولی سروکار دارید که سخت‌افزار فوق‌العاده‌ای دارد و برای تجربه بازی‌های جدید عالی است. دوربین‌‌های آن هم عملکرد خوبی از خود ارائه می‌کنند. صفحه نمایش با کیفیت هم از دیگر ویژگی‌های این گوشی هوشمند به شمار می‌رود. شک نکنید که شیائومی ۱۲ تی پرو محصولی فوق‌العاده است. اگر قصد دارید 4 تا 5 میلیون کمتر هزینه کنید، می‌توانید نسخه ارزان‌تر این قاتل پرچمدار یعنی شیائومی 12T را خریداری کنید.`,
    Specifications: {
      cpu: {
        model: "پردازنده / Qualcomm SM8475 Snapdragon 8+ Gen 1 5G",
        score: 9,
      },
      screen: { size: "سایز صفحه نمایش / 	6.67 اینچ", score: 8.8 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 8.7 },
      ram: { capacity: "رم / 12 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 200 مگاپیکسل", score: 9.1 },
      storage: { capacity: "حافظه داخلی / 256 گیگابایت", score: 8.9 },
      battery: { capacity: "باتری / 5000 میلی آمپر ساعت", score: 9 },
    },
    comments: [
      {
        star: 5,
        userName: "Mehran",
        date: "سه شنبه 5 آبان 1400",
        text: "من گرفتم فوق العادست...",
        like: 21,
        dislike: 7,
        positivePoints: [ "هرکول"],
        negativePoints: ["قیمت بالا"],
        reply: "مبارکتون باشه عزیز",
      },
      {
        star: 4,
        userName: "Elena",
        date: "جمعه 4 دی 1400",
        text: "من سفارش دادم ولی هنوز دستم نرسیده :(",
        like: 12,
        dislike: 1,
        reply: "صبور باشید فردا دستتون میرسه النای عزیز",
      },
    ],
  },
  {
    id: 20,
    quantity: 1,
    category: "phones",
    title: "موبایل شیائومی مدل 12 Pro",
    price: 28799000,
    imageURL: xiaomi12Pro,
    simcard: 2,
    camera: 50,
    ram: 12,
    storage: 256,
    system: 1,
    screen: 6.73,
    battery: 5000,
    positivePoints: [
      "طراحی جذاب و خوش‌دست",
      "نمایشگر فوق‌العاده",
      "دوربین باکیفیت",
      "باتری بادوام با سرعت شارژ شگفت‌انگیز",
    ],
    negativePoints: ["داغ شدن پردازنده"],
    technicalCheck: `شیائومی از بهترین کمپانی‌ها در زمینه تولید وسایل الکترونیکی و حتی غیر الکترونیکی در جهان است که اکثر کاربران با آن آشنایی دارند و حداقل تابه‌حال یکی از محصولات این برند را خریداری کرده‌اند؛ گوشی‌های شیائومی معمولاً قیمت مناسبی دارند و در قبال آن، سخت‌افزار خوبی هم ارائه می‌دهند که  موردپسند کاربران قرار می‌گیرند. جدیدترین گوشی شیائومی که از بهترین آن ها است و در دسته پرچمدارها قرار می گیرد، شیائومی 12 پرو  نام دارد؛ این گوشی در حقیقت تجمع قطعات خوب و باکیفیت حال حاضر بازار است، پردازنده اسنپدراگون قدرتمند و جدید، نمایشگر فوق‌العاده، دوربین 3 گانه باکیفیت و دیگر ویژگی ها که استفاده از این گوشی شیائومی را لذت بخش می کنند. در ادامه به بررسی این گوشی جدید یعنی شیائومی 12 Pro می پردازیم؛ همراه ما باشید. قیمت شیائومی 12 پرو 256 گیگابایت با رم 12 را در بالای همین صفحه مشاهده کردید. گوشی شیائومی 12 پرو از طراحی بسیار جذاب و خاصی استفاده می کند؛ قاب پشتی از جنس شیشه مات است که توسط گوریلاگلس 5 محافظت می شود و مقاومت بسیار زیادی در برابر خطو خش و ضربات از خود نشان می دهد. مات بودن قاب پشتی باعث می شود حس بسیار خوبی از در دست گرفتن این گوشی به شما دست دهد و اثرانگشت و کثیفی به هیچ عنوان روی قاب نمی ماند. گوشی شیائومی 12 پرو تنها 204 گرم وزن دارد و با اینکه از بسیاری از گوشی ها وزن بیشتری دارد، اما فوق‌العاده خوش‌دست و در دست گرفتن آن در مدت زمان زیاد راحت است؛ این گوشی 8.2 میلی متر ضخامت دارد و در طول 163.6 و عرض 73.6 ساخته شده، با مشاهده اعداد و ارقام هم می توان متوجه شد که این گوشی چقدر خوش‌دست است و در اندازه های مناسبی طراحی شده. در نتیجه می توانید با یک دست به راحتی با گوشی کار کنید و به تمام نقاط نمایشگر دسترسی داشته باشید. فریم میانی گوشی رابط قاب پشتی با نمایشگر است که آلومینیومی در نظر گرفته شده و مقاومت زیادی در برابر ضربات و خط و خش دارد؛ از طرفی این فریم به خوبی طراحی شده و مهندسان شیائومی به بهترین حالت ممکن توانسته اند فریمی انعطاف پذیر با خمیدگی نمایشگر طراحی کنند و ظاهری بسیار زیبا و جذاب به آن ببخشند. علاوه بر زیبایی ظاهری، در دست گرفتن آن هم حس بسیار خوبی به کاربر می دهد. روی فریم فلزی درگاه ها و دکمه های کاربردی گوشی قرار گرفته اند که در سمت راست شامل دکمه پاور و دکمه های افزایش و کاهش صدا، فریم پایین شامل درگاه شارژ تایپ C، اسپیکر اول، میکروفون اول و درگاه سیمکارت می شود. در سمت چپ درگاه و دکمه خاصی دیده نمی شود اما در بالای فریم اسپیکر دوم، میکروفون دوم و حسگر مادون قرمز قرار گرفته که می توانید به کمک آن دستگاه های الکترونیکی مانند کولر، فر، چیلر و بسیاری دیگر را کنترل کنید. 
    مانی که گوشی شیائومی 12 پرو را در دست می گیریم، حس خوبی که قاب مات پشتی گوشی به دستان ما می بخشد، دوست داشتنی و ارزشمند است؛ این قاب از جنس شیشه و پلاستیک است که توسط گوریلا گلس 5 محافظت شده و در برابر ضربات و گرد و غبار بسیار مقاوم شده است. اما متاسفانه اطلاعاتی در مورد گواهی ضدآب این گوشی اعلام نشده که احتمالا ضدآب نیست و این می تواند یک نقطه ضعف برای گوشی پرچمدار محسوب شود. از طرفی قاب پشتی میزبان دوربین های این گوشی است که درون ماژول بزرگ مستطیل شکل قرار گرفته اند؛ این ماژول بیرون زدگی نسبتا زیادی دارد و می توانست کوچکتر باشد، اما دست را آزار نمی دهد و فقط هنگام استفاده از قاب ممکن است گاهی مزاحمت ایجاد کند. یکی از بهترین نمایشگرهای حال حاضر گوشی‌های هوشمند اندرویدی را در اختیار خواهید داشت، نمایشگری از نوع LTPO AMOLED که روشنایی فوق‌العاده 1000 نیتی دارد که در حالت اتوماتیک به نهایت قدرت خود یعنی 1500 نیت می رسد که برای استفاده از گوشی در محیط بیرون از خانه بسیار خوب است. این نمایشگر وضوح بسیار بالای 1440 در 3200 پیکسل به همراه تراکم پیکسلی 521 پیکسل در هر اینچ دارد که برای نمایشگری به این بزرگی بسیار خوب و حتی مقدارش زیاد است. لاوه بر پنل قدرتمند، این گوشی می تواند گستره رنگی 1 میلیاردی را پوشش دهد؛ در نتیجه رنگ ها دقیق تر با وضوح بالا برای شما به نمایش در می آیند. این نمایشگر مجهز ب فناوری دالبی ویژن است که در هرچه بهتر نشان دادن تصاویر موثر است و به لطف ویژگی HDR10+ بهترین نتیجه را به شما ارائه می دهد. این نمایشگر از رفرش ریت 120 هرتز هم پشتیبانی می کند که سرعت نشان دادن محتوا مخصوصا در وب و رابط کاربری گوشی را بالا می برد.
     گوشی شیائومی 12 پرو یکی از برترین های حال حاضر بازار گوشی‌های هوشمند محسوب می شود که مجهز به برترین ویژگی ها از جمله اسپیکر استریو بسیار باکیفیت است؛ شیائومی در این گوشی از چهار خروجی اسپیکر باکیفیت و قدرتمند استفاده کرده که توسط کمپانی محبوب و معروف هارمن کاردن تهیه و تنظیم شده است. این اسپیکرها بیس بسیار خوب و در کنار آن تریبل باکیفیت و دقیقی دارند که باعث می شود دیدن فیلم یا گوش دادن به موسیقی و همچنین بازی کردن لذت بخش تر شود. زمانی که با این گوشی موسیقی پخش می کنید، از هر طرف آن صدای شفاف و باکیفیت به گوشتان می رسد؛ هر چهار طرف گوشی دارای اسپیکر است، در فریم بالایی دو اسپیکر و در فریم پایینی هم دو اسپیکر دیگر جای گرفته که باعث می شوند صدا به صورت استریو پخش شود. قابلیت پخشDolby  باعث می شود ریز به ریز جزئیات موسیقی را درک کنید و بشنوید. همانطور که انتظار داریم از گوشی‌های امروزی پرچمدار، این گوشی ها دیگر از جک 3.5 میلی متری هدفون برخوردار نیستند و برای استفاده از هدفون باید از تبدیل جک 3.5 به تایپ C یا هدفون بی سیم استفاده کنید. گوشی شیائومی 12 پرو یکی از گوشی‌هایی است که مجهز شده به اندروید 12 و رابط کاربری MiUi 13 تا با بهترین نرم افزار ساخته شده تا کنون توسط شیائومی روی گوشی‌هایش طرف باشیم. این رابط کاربری و سیستم عامل به خوبی با یکدیگر بهینه و هماهنگ شده اند تا کاربر طی استفاده طولانی مدت هم از آن خسته نشود و بتواند با امکان دسترسی های گسترده ای که به رابط کاربری دارد، آن ها را تغییر دهد تا گوشی برایش تکراری نشود. این گوشی حداقل 3 سال جدیدترین به روزرسانی های اندروید و شیائومی را دریافت می کند، در نتیجه می توانید تا سال ها از این گوشی لذت ببرید بدون هیچ مشکل نرم افزاری خاصی. گوشی شیائومی 12 پرو مجهز به یک باتری قدرتمند با ظرفیت 4600 میلی آمپر ساعت است که به خوبی می تواند تا ساعت ها شارژ نگه دارد و نیروی این گوشی پرچمدار باکیفیت را تامین کند. این باتری مجهز به فناوری های مختلف شارژ است که باعث شارژ سریع و شارژ ایمن می شود. اگر به دنبال یک گوشی با باتری قدرتمند و ماندگار می گردید، گوشی شیائومی 12 پرو با ظرفیت 4600 میلی آمپر ساعت می تواند گزینه خوبی برای خرید باشد. 
     گوشی Xiaomi 12 پرو به دلایل مختلفی می تواند بهترین گوشی سال شیائومی لقب بگیرد، هم به دلیل خوش قیمت بودنش به نسبت سخت‌افزار و هم به دلیل استفاده از بالاترین و بهترین ویژگی ها در این گوشی؛ شیائومی 12 پرو مجهز به نمایشگری بسیار پر نور و باکیفیت، دوربینی قدرتمند، پردازنده ای بهینه و عالی و پکیج باتری پر سرعت و بادوام است که همه این ها در طراحی بسیار مناسب و خوش‌دست یکجا جمع شده اند تا حس خوب پیروزی از خرید گوشی را به کاربر انتقال بدهند. اگر اهل بازی کردن هستید یا به نگاه کردن فیلم در گوشی علاقه دارید، یا اصلا اهل وب گردی هستید و عکاسی می کنید، ما به شما خرید گوشی شیائومی 12 پرو را پیشنهاد می کنیم.`,
    Specifications: {
      cpu: {
        model: "پردازنده / Qualcomm SM8450 Snapdragon 8 Gen1",
        score: 9,
      },
      screen: { size: "سایز صفحه نمایش / 	6.73 اینچ", score: 8.8 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 8.7 },
      ram: { capacity: "رم / 12 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 50 مگاپیکسل", score: 9.1 },
      storage: { capacity: "حافظه داخلی / 256 گیگابایت", score: 8.9 },
      battery: { capacity: "باتری / 5000 میلی آمپر ساعت", score: 9 },
    },
    comments: [
      {
        star: 5,
        userName: "علیرضا",
        date: "پنجشنبه 5 آذر 1400",
        text: "یه روز میخرمت جذاب لنعتی !",
        like: 10,
        dislike: 1,
        positivePoints: ["باطری عالی", "دوربین فوق العاده"],
        negativePoints: ["خیلی گرونه"],
        reply: "انشالله عزیز 🙏🌹",
      },
      {
        star: 4,
        userName: "محمد مهدی",
        date: "سه شنبه 5 آبان 1400",
        text: "من گرفتم فوق العادست... \n ممنون از سایت و ارسال سریع شما",
        like: 7,
        dislike: 2,
        positivePoints: ["صفحه نمایش خفن", "جذاب"],
        negativePoints: ["قیمت بالا"],
        reply: "مبارکتون باشه ",
      },
      {
        star: 3,
        userName: "آیدا رضایی",
        date: "جمعه 17 دی 1400",
        text: "من سفارش دادم ولی هنوز دستم نرسیده :(",
        like: 12,
        dislike: 4,
        reply: "صبور باشید فردا دستتون میرسه آیدای عزیز",
      },
    ],
  },
  {
    id: 21,
    quantity: 1,
    category: "phones",
    title: "موبایل سامسونگ Galaxy S22 Ultra",
    price: 42300000,
    imageURL: galaxyS22Ultra,
    simcard: 2,
    camera: 108,
    ram: 12,
    storage: 1000,
    system: 1,
    battery: 5000,
    screen: 6.8,
    screen: 6.8,
    positivePoints: [
      "طراحی باریک و زیبا",
      "دوربین فوق‌العاده",
      "پردازنده قدرتمند",
      "نمایشگر بی‌نظیر",
      "قلم با کمترین میزان تأخیر",
    ],
    negativePoints: [
      "نبود شارژر در جعبه گوشی",
      "ظرفیت کم باتری به میزان مصرف سخت‌افزار",
    ],
    technicalCheck: `انتظارات به پایان رسید و پس از شایعه‌های بسیار، گوشی S22 اولترا سامسونگ معرفی شد و هم اکنون در فروشگاه تکنولایف قابل خریداری است. گوشی سامسونگ s22 اولترا دارای ویژگی‌های فوق‌العاده جذاب و جدید است که شکل شمایلش ما را یاد نوت 20 اولترا می‌اندازد. در نهایت سامسونگ s22 اولترا با قلم همراه عرضه شد که درون بدنه گوشی جای می‌گیرد و دوربینی مانند S21 اولترا اما پیشرفته‌تر برای آن در نظر گرفته شده که کار کردن با دوربین این گوشی شما را به وجد می‌آورد. قیمت S22 Ultra و رنگ های مختلف آنرا در سایت تکنولایف ببنید.
سامسونگ هرساله خانواده پرچمدار جدید خود را به کاربران معرفی و به بازار عرضه می‌کند که اغلب شامل سه مدل استاندارد، پلاس و اولترا می‌شود؛ مدل استاندارد با قابلیت‌های مناسب و قیمت خوب، مدل پلاس با قابلیت‌های مشابه با نسخه استاندارد اما با اندازه بزرگ‌تر و قیمت بیشتر و در نهایت مدل اولترا با بالاترین قابلیت‌ها و بهترین آن‌ها ساخته می‌شود که به‌نوعی پرچمدار پرچمدارها شناخته می‌شود. با نگاه به مشخصات s22 ultra سامسونگ، تا حدودی متوجه قدرت این هیولای کره‌ای خواهیم شد، اما با کار کردن و در دست گرفتن آن، فراتر از انتظارتان عمل می‌کند و شما را شگفت‌زده خواهد کرد. در ادامه علاوه بر بررسی مشخصات گوشی سامسونگ s22 اولترا، آن را به چالش می‌کشیم تا ارزش آن را بسنجیم و ببینیم آیا خرید سامسونگ s22 ultra با این قیمت منطقی است یا خیر؛ همراه ما باشید. قیمت گوشی S22 اولترا با حافظه 256 و رم 12 گیگابایت را در بالا مشاهده کردید. طراحی گوشی موبایل سامسونگ مدل galaxy s22 ultra 5g به‌قدری هنرمندانه و مهندسی شده است که حتی با نگاه به قیمت گوشی سامسونگ s22 ultra در ایران، باز هم دلتان می‌خواهد هر طور شده این گوشی را خریداری کنید؛ یک گوشی با لبه‌های Curve یا همان خمیده که نمایشگر تا قاب پشتی ادامه یافته و وقتی به نمایشگر نگاه می‌کنید، زاویه دید فوق‌العاده‌ای به چشمان شما تقدیم می‌کند.
بزرگ و با ابهت، اما خوش‌دست
با در دست گرفتن این گوشی، ابتدا حس خوب خمیدگی لبه‌های آلومینیومی شما را مشتاق کار کردن با این گوشی می‌کند، اما ابعاد نسبتاً بزرگ آن ممکن است برای دست‌های کوچک آزاردهنده باشد و حتی مجبور باشید برای استفاده از دو دست استفاده کنید. البته به دلیل طول 163.3 میلی‌متری و عرض 77.9 مجبور می‌شوید برای لمس بالای نمایشگر از هر دو دستتان استفاده کنید. خوشبختانه قطر گوشی سامسونگ گلکسی s22 اولترا تنها 8.9 میلی‌متر است که با توجه به وجود قلم و دوربین‌های بزرگ، زیاد نیست و به‌خوبی در دست جای می‌گیرد. پنل جلویی اولین چیزی است که به چشم می‌خورد، نمایشگری 6.8 اینچی که حدود 90.2 درصد از پنل را فرا گرفته و در حقیقت هرجایی از این پنل را که نگاه می‌کنید، فقط نمایشگر می‌بینید. این نمایشگر به‌خوبی توسط گوریلاگلس وکتوس پلاس محافظت شده که مقاومت فوق‌العاده بالایی دارد و می‌تواند در برابر سقوط از ارتفاع بیش از 2 متر جان سالم به در ببرد. البته که به جز شکستن، در برابر خط‌وخش هم مقاومت بسیار زیادی دارد و به‌راحتی خش نمی‌افتد. در بالای پنل یک حفره بسیار ریز قرار گرفته که درون آن دوربین سلفی مشاهده می‌شود. پس از پنل جلویی حالا نوبت به قاب پشتی می‌رسد، جایی که دوربین‌های قدرتمند این گوشی جای گرفته‌اند؛ در ابتدا حسگرهای دوربین جلب‌توجه می‌کنند، چهار حسگر بزرگ به همراه فلش LED بدون ماژول دوربین و برآمدگی خاصی برای جایگاه لنزها. این طراحی به نسبت نسخه قبلی یعنی S21 اولترا بیشتر به دل کاربران نشسته و این به هوش طراحان گوشی s22 ultraمربوط می‌شود که به‌خوبی خواسته کاربرانشان را می‌دانند. به جز لنزها فقط لوگوی برند سامسونگ در پایین گوشی دیده می‌شود که رنگ آینه‌ای دارد و به‌راحتی قابل دیدن است. قاب پشتی از جنس شیشه ساخته شده که توسط گوریلاگلس وکتوس پلاس از آن محافظت می‌شود، در نتیجه مقاومت زیادی در برابر خط‌وخش و ضربات دارد. از قاب پشتی و پنل جلویی که بگذریم، نوبت به فریم میانی گوشی می‌شود، فریمی که به دلیل خمیدگی نمایشگر زیاد نیست اما میزبان درگاه‌ها و پورت‌های مختلفی است که کاربردی هستند و وجود آن‌ها لازم است. در سمت راست فریم دکمه‌های کاهش و افزایش حجم صدا و دکمه پاور قرار گرفته، اما در سمت چپ خبری از درگاه یا دکمه‌ای نیست. در بالای فریم تنها میکروفون دوم دیده می‌شود، اما فریم پایین دستگاه میزبان درگاه سیم‌کارت، میکروفون اول، درگاه شارژ تایپ C، اسپیکر و از همه مهم‌تر جایگاه قلم گوشی است. فریم این گوشی هم از جنس آلومینیوم است که توسط روکش بسیار قدرتمند، توانایی دوام زیادی در برابر ضربات دارد.
 قلم در گوشی‌های هوشمند زیادی دیده نمی‌شود و در حال حاضر تنها گوشی دنیا که با قلم همراه عرضه می‌شود S22 اولترا است؛ قلم این گوشی ما را یاد Note 20 Ultra می‌اندازد که در سال 2019 وارد باز شد و کاربران هنوز هم معتقدند بهترین گوشی قلم دار در دنیا هست. اما حالا سامسونگ s22ultraآمده تا هم خاطرات آن گوشی را برایمان زنده کند و هم قابلیت‌های خوب آن گوشی را بهبود ببخشد. قلم Stylus گلکسی S22 اولترا از فریم پایینی وارد گوشی می‌شود و زمانی که آن را به داخل فشار دهید، به بیرون می‌جهد تا بتوانید به‌راحتی آن را بردارید. ین قلم فقط 2.8 میلی‌ثانیه تأخیر دارد، این به معنای عملکرد فوق‌العاده سریع این قلم است که باعث می‌شود بتوانید نقاشی و طراحی‌های فوق‌العاده‌ای با این قلم انجام دهید. قلم زمانی که در جای خودش قرار می‌گیرد، به‌صورت اتوماتیک شارژ می‌شود و به‌خوبی شارژ را نگه می‌دارد. طراحی با این قلم روی گوشی S22 اولترا سامسونگ، با صدای کاغذ مانندی که هنگام کشیدن روی صفحه ایجاد می‌کند، حس طراحی و نوشتن روی دفتر کاغذی را به شما القا می‌کند و باعث می‌شود بیشتر مشتاق به کار با قلم این گوشی شوید. البته علاوه بر طراحی و نوشتن، می‌توانید به کمک قلم از راه دور گوشی را کنترل کنید که به لطف حسگر ژیروسکوپ و شتاب‌سنج این امکان به وجود آمده است. وقتی با پرچمدار گوشی سامسونگ روبه‌رو هستیم، پس انتظار گواهی‌های ضد آب نظامی هم داریم و این گوشی سامسونگ هم به‌خوبی انتظاراتمان را برآورده کرده است. شما می‌توانید گوشی گلکسی S22 اولترا سامسونگ را به مدت 30 دقیقه تا عمق 1.5 متری ببرید و از آن زیر آب استفاده کنید. این گوشی مجهز به گواهی Ip68 نظامی است اما به دلیل داشتن قلم، نمی‌تواند مدت‌زمان زیادی را زیر آب دوام بیاورد.
  از آنجایی که galaxy s22 ultra قیمت بالایی دارد و بهترین گوشی سامسونگ در حال حاضر محسوب می‌شود، پس از بهترین قابلیت‌ها برای آن استفاده شده است؛ حسگر اثر انگشت استفاده شده در این گوشی از نوع اولتراسونیک است و زیر نمایشگر گنجانده شده. این حسگر سرعت عملکرد فوق‌العاده بالایی دارد و میزان خطایش بسیار پایین است، حتی اگر دست خیس و یا کثیف هم باشد به‌راحتی اثر انگشت را تشخیص می‌دهد. ا اینکه گوشی سامسونگ S22 اولترا گلکسی نقطه عطف‌های زیادی دارد، اما یکی از مهم‌ترین آن‌ها که می‌تواند دلیل قانع‌کننده‌ای برای خرید این شاهکار باشد، صفحه‌نمایش است؛ نمایشگر این غول قدرتمند مجموعه‌ای کامل از ویژگی‌های فوق‌العاده است که باعث می‌شود در مجموع کیفیت، وضوح، زاویه دید، روشنایی و عمق رنگ بسیار خوبی به چشمان شما هدیه دهد. در حقیقت اگر نمایشگر گوشی کیفیت و وضوح خوبی نداشته باشد، حتی هنگام وب‌گردی هم آزارتان می‌دهد و اینجاست که ارزش نمایشگر باکیفیت مشخص می‌شود. نمایشگر گوشی S22 ultra سامسونگ برای وب‌گردی، فیلم دیدن، بازی و حتی طراحی عالی است و اگر به دنبال خرید گوشی با بهترین نمایشگر باشید، یکی از آن‌ها این گوشی است. خورشید در دستان شماست؛ روشنایی بی‌نظیر نمایشگر گلکسی S22 ultra
یکی از برترین‌ها در روشنایی نمایشگر گوشی گلکسی اس 22 اولترا است؛ نمایشگر این دستگاه دارای روشنایی 1750 نیت است که در حالت adaptive فعال می‌شود، یعنی اگر این ویژگی را فعال کنید، در زیر نور آفتاب روشنایی به 1750 نیت می‌رسد که میزان فوق‌العاده‌ای برای یک گوشی محسوب می‌شود. از طرفی این نمایشگر توسط گوریلاگلس وکتوس پلاس محافظت می‌شود که به معنی سختی و مقاومت فوق‌العاده زیاد آن است؛ این نمایشگر در برابر خط‌وخش مقاومت بالایی دارد و اگر از ارتفاع بیشتر از 2 متر هم بی افتد، نمی‌شکند، اما امکان دارد روی سطح‌هایی مانند آسفالت و سنگ آسیب ببیند که عادی است.
 گوشی‌های امروزی مخصوصاً پرچمدارها دیگر میزبان درگاه جک 3.5 میلی‌متری هدفون نیستند و برای استفاده از هدفون باید از هدفون بی سیم یا درگاه شارژ استفاده کنید؛ اما گلکسی S22 اولترا دارای دو اسپیکر فوق‌العاده قدرتمند است که یکی در فریم پایینی و دیگری در بالای نمایشگر قرار دارد. البته اسپیکر دوم جداگانه تعبیه نشده و با اسپیکر مکالمه یکی است، اما بلندی صدا و کیفیت فوق‌العاده‌ای دارد. صدا به‌صورت استریو با قابلیت دالبی اتموس پخش می‌شود، یعنی از هر دو اسپیکر به‌صورت هم‌زمان صدا می‌شنوید یا اگر صدا از چپ پخش شود فقط اسپیکر سمت چپی و اگر از راست پخش شود فقط از اسپیکر راستی صدا را می‌شنوید؛ این ویژگی در فیلم دیدن حس سینما بودن را به شما می‌دهد و به‌خصوص در بازی‌های آنلاین کمک می‌کند تا جای دشمنان خود را تشخیص دهید و پیروز شوید. اسپیکرهای این گوشی توسط کمپانی معروف AKG تهیه و تنظیم شده، این کمپانی یکی از قدیمی‌ترین برندهای تولیدکننده اسپیکر و هدفون است که سال‌هاست با سامسونگ همکاری می‌کند. کی از ویژگی‌های مهم این گوشی قلم آن است؛ برای اینکه به‌راحتی بتوانید از قابلیت‌های قلم استفاده کنید، رابط کاربری باید دست خوش تغییراتی شود و رابط کاربری‌اش با دیگر گوشی های سامسونگی تفاوت داشته باشد، در نتیجه سامسونگ در طراحی OneUi این گوشی تغییراتی ایجاد کرده و یک سری ویژگی جدید اضافه کرده که شامل برنامه طراحی و نقاشی حرفه‌ای با قلم در گوشی است و دیگر ویژگی‌هایی برای کنترل گوشی با قلم از راه دور و قابلیت‌های تبدیل نوشته به متن در اس‌ام‌اس و نوت‌بوک. همان‌طور که گفتیم این گوشی با دو نسخه اگزینوس 2200 و اسنپ دراگون 8 نسل 1 وارد بازار جهانی شده، اما نسخه اگزینوس اغلب برای کشورهای اروپایی و آسیای غربی عرضه می‌شود و نسخه اسنپ دراگون برای آمریکا و آسیای شرقی؛ نهایتاً انتظارها به پایان رسید و شرکت تکنولایف نسخه اسنپ دراگون این گوشی را موجود و آماده سفارش کرده برای آن دسته از افرادی که فقط به پردازنده آمریکایی شرکت کوالکام اعتماد می‌کنند. از آنجایی که پردازنده این گوشی اسنپ دراگون است، پس سعی کردیم تا آن را تحت‌فشار قرار دهیم و نهایت قدرت آن را بسنجیم؛ گوشی گلکسی S22 Ultra سامسونگ به پردازنده اسنپ دراگون 8 نسل 1 مجهز شده و با پردازنده گرافیکی Adreno 730 – ROW وظیفه پردازش اعمال گرافیکی را بر عهده دارند.
  یکی از بهترین ویژگی‌های این گوشی پرچمدار، وجود شارژ بی سیم و شارژ معکوس برای شارژ کردن خود گوشی یا شارژ کردن گوشی دیگر یا هدفون‌های بی سیم است. به کمک شارژ سریع بی سیم می‌توانید گوشی را با سرعت 15 وات شارژ کنید، درست است، این گوشی نه‌تنها دارای شارژ بی سیم و شارژ معکوس است، بلکه از شارژ سریع بی سیم و شارژ سریع معکوس پشتیبانی می‌کند. برای شارژ بی سیم فناوری شارژ سریع 15 وات و برای شارژ معکوس از فناوری شارژ سریع 4.5 وات استفاده می‌کند که باعث می‌شود هدفون بی سیم، ساعت هوشمند یا گوشی دیگر را با سرعت بیشتری شارژ کند یا از شارژرهای بی سیم با سرعت بیشتری شارژ دریافت کند. دوربین اولترا واید این گوشی از سنسور 12 مگاپیکسلی تشکیل شده که عملکرد فوق‌العاده در نور مناسب دارد، در حقیقت در نور روز عکس‌هایی ثبت می‌کند که از نظر کیفیت و وضوح تصویر تفاوتی با دوربین اصلی ندارد و خمیدگی گوشه‌های تصویر به حداقل رسیده و بسیار طبیعی شده است. این حسگر برای ثبت عکس از طبیعت عالی است و پیشنهاد می‌کنیم اگر به عکاسی علاقه‌مند هستید، از این حسگر در طبیعت استفاده کنید و لذت ببرید.
    اگر می‌خواهید یک فیلم سینمایی حرفه‌ای با گوشی اندرویدی بسازید، بهترین گزینه برای انتخاب گلکسی اس 22 اولترا است؛ دوربین این گوشی در فیلم‌برداری فوق‌العاده عمل می‌کند. حالت فیلم‌برداری UHD در 60 فریم بهترین نتیجه را می‌دهد که در آن هم کیفیت تصویر عالی است و هم تصویر بسیار نرم و روان ثبت می‌شود. به لطف استبلایزر یا همان لرزش‌گیر اپتیکال، حتی در هنگام دویدن هم تصویر تکان نمی‌خورد و نیازی به اوزمو نخواهید داشت. یکی از ویژگی‌های فوق‌العاده این دوربین در فیلم‌برداری فوکوس دستی فوق‌العاده سریع و هوشمند آن است که به‌راحتی با کمترین پرش تصویر سوژه را شناسایی می‌کند و این کار را می‌توانید به‌صورت دستی خیلی آسان انجام دهید. `,
    Specifications: {
      cpu: {
        model: "پردازنده / Qualcomm SM8450 Snapdragon 8 Gen 1",
        score: 9,
      },
      screen: { size: "سایز صفحه نمایش / 	6.8 اینچ", score: 8.8 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 8.7 },
      ram: { capacity: "رم / 12 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 108 مگاپیکسل", score: 9.1 },
      storage: { capacity: "حافظه داخلی / 1 ترابایت", score: 8.9 },
      battery: { capacity: "باتری / 5000 میلی آمپر ساعت", score: 9 },
    },
    comments: [
      {
        star: 5,
        userName: "علیرضا",
        date: "پنجشنبه 5 آذر 1400",
        text: "یه روز میخرمت جذاب لنعتی !",
        like: 10,
        dislike: 1,
        positivePoints: ["باطری عالی", "دوربین فوق العاده"],
        negativePoints: ["خیلی گرونه"],
        reply: "انشالله عزیز 🙏🌹",
      },
      {
        star: 4,
        userName: "محمد مهدی",
        date: "سه شنبه 5 آبان 1400",
        text: "من گرفتم فوق العادست... \n ممنون از سایت و ارسال سریع شما",
        like: 7,
        dislike: 2,
        positivePoints: ["صفحه نمایش خفن", "جذاب"],
        negativePoints: ["قیمت بالا"],
        reply: "مبارکتون باشه ",
      },
      {
        star: 3,
        userName: "آیدا رضایی",
        date: "جمعه 17 دی 1400",
        text: "من سفارش دادم ولی هنوز دستم نرسیده :(",
        like: 12,
        dislike: 4,
        reply: "صبور باشید فردا دستتون میرسه آیدای عزیز",
      },
    ],
  },
  {
    id: 22,
    quantity: 1,
    category: "phones",
    title: "موبایل سامسونگ Galaxy Z Fold 4",
    price: 69000000,
    imageURL: galaxyZfold,
    simcard: 2,
    camera: 50,
    ram: 12,
    storage: 1000,
    system: 1,
    battery: 4000,
    screen: 7.6,
    positivePoints: [
      "گواهی IPX8 و دوام بیشتر نمایشگر منعطف دستگاه",
      "نرخ نوسازی ۱۲۰ هرتزی تطبیق‌پذیر روی هر دو نمایشگر",
      "عملکرد بسیار خوب و پایدار به‌مدد لیتوگرافی TSMC",
      "تجربه‌ی چندوظیفگی روان و بسیار لذت‌بخش",
      "بهبود چشم‌گیر شارژدهی",
      "پشتیبانی از قلم",
    ],
    negativePoints: [
      "تکرار طراحی؛ ابعاد عجیب، ضخیم و نه‌چندان ارگونومیک",
      "احتمال آسیب‌دیدن گوشی در مجاورت گردوغبار",
    ],
    technicalCheck: `گلکسی فولد سامسونگ در سه نسل پیشین، پیشرفت‌های قابل‌ملاحظه‌ای را تجربه کرد تا چشم‌انداز کره‌ای‌ها برای گوشی‌های تاشدنی به‌عنوان آینده‌ی گوشی‌های هوشمند را با سرعت بیشتری در بازار مصرف‌کننده جا بیندازد. برای مثال، فولد ۲ با حذف ناچ دوربین سلفی، مقاوم‌تر شدن لولا و افزایش ابعاد نمایشگر کاور همراه بود و پشتیبانی از قلم S Pen و دریافت غافلگیرکننده‌‌‌ی گواهی IPX8 در فولد ۳ که برای اولین بار این گوشی را دربرابر آب مقاوم کرد، از میزان تردید و ناباوری ما در مورد موفقیت پروژه‌ی بلندپروازانه‌ی سامسونگ تاحدودی کم کرد. ما در تاشدنی جدید سامسونگ خبری از بهبود‌های چشمگیر نیست و به‌نظر می‌رسد کره‌ای‌ها این یک سال را صرف صیقل دادن تغییراتی کرده‌اند که در سه نسل قبلی زد فولد اعمال شده است؛ تصمیمی که راستش را بخواهید، تاحدی ناامید‌کننده بود، چراکه انتظار داشتیم با برچسب قیمتی ۱۸۰۰ دلاری و بعد از چهار سال تحقیق و توسعه، مشکل کشیدگی نامتداول نسبت تصویر که در Mate Xs 2 هواوی تقریباً حل شده یا فضای خالی بین دو نمایشگر در حالت بسته که در میکس فولد ۲ شیائومی وجود ندارد، برطرف می‌شد. علاوه‌براین، تاخوردگی نمایشگر در محل لولای فولد نیز کماکان به‌اندازه‌ای عمیق است که هنگام تماشای ویدئو، باعث حواس‌پرتی می‌شود.
گلکسی زد فولد ۴ سه میلی‌متر کوتاه‌تر، دو میلی‌متر کم‌عرض‌تر و تنها ۰٫۱ درصد باریک‌تر شده و با وزن ۲۶۳ گرم که فقط ۸ گرم سبک‌تر از نسل گذشته است و کماکان برای زمانی‌که می‌خواهید با یک دست گوشی را حمل کنید، دستگاه نسبتاً سنگینی به‌شمار می‌رود؛ مگر اینکه بخواهید گلکسی زد فولد را بیشتر تبلت تاشدنی در نظر بگیرید تا گوشی تاشدنی که در این صورت از تمام تبلت‌های سبک‌وزن بازار، سبک‌تر است. علاوه‌براین، تغییرات در ابعاد به‌حدی ناچیز است که اگر هر دو گوشی را کنار هم بگذارید، تشخیص آن‌ها تقریباً غیرممکن خواهد بود. صفحه‌نمایش اصلی زد فولد ۴ از همان پنل ۷٫۶ اینچی گذشته استفاده می‌کند؛ با این تفاوت که نسبت نمایشگر به بدنه با افزایش ۲٫۱ درصد به ۹۰٫۹ درصد رسیده و حاشیه‌ها باریک‌تر شده‌اند. دوربین سلفی نیز که از نسل گذشته به زیر پنل منتقل شده، حالا به شکل بهتری استتار شده است تا حواس کاربر هنگام تعامل با محتوا از جمله تماشای ویدئو، کمتر پرت شود.
صفحه‌نمایش بیرونی نیز از فولد ۲ تا نسل چهارم دست‌نخورده باقی مانده و ۶٫۲ اینچی معرفی شده؛ هرچند افزایش جزئی عرض پنل و تغییر نسبت‌تصویر از ۲۴٫۵:۹ به ۲۳٫۱:۹، به افزایش اندک وسعت صفحه کمک کرده است. بااین‌حال، در حالت بسته، این نسبت‌تصویر در مقایسه با گوشی‌های متداول یا حتی گوشی‌های تاشدنی رقیب از جمله Mate Xs 2 هواوی، به‌حدی کشیده است که کماکان حس در دست داشتن ریموت‌کنترل تلویزیون را به کاربر منتقل می‌کند. واقعیت این است که طراحی گوشی‌های تاشدنی باوجود تلاش سامسونگ برای بهبود و عادی‌سازی آن‌ها، هنوز فاصله‌ی زیادی با بی‌عیب‌ونقص شدن دارد. در دست گرفتن زد فولد در حالت بسته با‌ توجه به نمایشگر باریک، اگرچه برای دستان کوچک‌تر ایدئال است، کماکان برای کاربری روزمره از جمله تایپ‌کردن با صفحه‌کلید حتی با انگشت‌های کوچک چندان مناسب نیست و نهایتاً بتوانید کم‌دردسرترین تجربه‌ی کاربری را در همان حالت تبلت داشته باشید.
بدنه‌ی گلکسی زد فولد ۴ از همان آلیاژ Armor Aluminium به کار رفته در نسل گذشته ساخته شده که سبک و مقاوم است، اما پنل پشتی و محافظ نمایشگر کاور از جنس گوریلا گلس ویکتوس پلاس با قدرت محافظتی بیشتر از نسخه‌ی معمولی است که در زد فولد ۳ به کار رفته است. همچنین به‌گفته‌ی سامسونگ، صفحه‌نمایش منعطف و سازگار با قلم S Pen زد فولد ۴ حالا ۴۵ درصد مقاوم‌تر از گذشته است و در بررسی ما،‌ ژست‌های حرکت با نرمی بسیار رضایت‌بخشی روی آن صورت گرفتند. عمده‌ترین تفاوت نمایشگر گلکسی Z fold 4 با نسل پیشین را می‌توان در ردیف پیکسل‌های افقی کمتر و پیکسل‌های عمودی بیشتر دانست. به تعبیر دیگر نسل جدید گوشی تاشو سامسونگ، اندازه‌ای مربعی‌تر دارد و نسبت صفحه‌نمایش آن نیز از ۳:۴ به ۵:۶ تغییر پیدا کرده است. به‌طور دقیق‌تر، نسبت ۹:۱۱٫۲ جای خود را به ۹:۱۰٫۸ داده است.
تغییر یادشده باعث شده تا نمایشگر خارجی دستگاه نیز از حالت کشیده خود خارج شود و کمی به نسبت مرسوم گوشی‌های هوشمند نزدیک‌تر شود؛ البته فقط و فقط «کمی». لازم به‌ذکر است که فرورفتگی قسمت مرکزی نمایشگر نیز همچنان به قوت خود وجود دارد اما برخلاف زد فلیپ که در حین اسکرول کردن همواره این بخش را لمس خواهید کرد، در زد فولد کمتر با چنین شرایطی رو‌به‌رو خواهید شد. حداکثر روشنایی نمایشگر داخلی گلکسی زد فولد ۴ به ۶۵۳ نیت می‌رسد؛ این عدد برای نمایشگر خارجی ۵۶۶ نیت خواهد بود و با حضور در محیط‌های پرنور مانند زیر نور خورشید، با فعال بودن روشنایی خودکار می‌توانید به ترتیب به ۱۳۷۰ و ۱۳۹۵ نیت دست پیدا کنید. عددی فوق‌العاده که حتی از عدد اعلامی ۱۲۰۰ نیت خود سامسونگ نیز پا را فراتر می‌گذارد.
با توجه به اینکه دستیابی به سطح روشنایی فراتر از ۶۰۰ نیت تنها در زیر نور خورشید یا محیط‌های فوق‌العاده پرنور قابل دستیابی خواهد بود، سامسونگ ویژگی Extra Brightness را در بخش تنظیمات صفحه‌نمایش تعبیه کرده است. البته ویژگی یادشده تنها در زمان غیرفعال بودن روشنایی خودکار دردسترس خواهد بود. ما میزان روشنایی نمایشگر داخلی و خارجی را در این حالت به‌ترتیب ۱۰۶۷ و ۱۱۱۳ نیت اندازه‌گیری کردیم. با در نظر گرفتن امتیاز CPU در نرم‌افزار GeekBench 5، تفاوت قابل ذکری بین Snapdragon 8 Gen 1 و نسخه‌ی پلاس وجود ندارد. اگر عملکرد آیفون ۱۳ پرو مکس را در همین بنچمارک ملاک قرار دهیم، خواهیم دید که تراشه‌ی A15 Bionic اپل همچنان در عملکرد چندهسته‌ای CPU با اختلاف حدود ۳۰ درصدی رقیب خود را پشت سر می‌گذارد.
با اینکه انتظار داشتیم تراشه‌ی جدید، جهش قابل توجهی در تمام جنبه‌های عملکرد زد فولد ۴ نسبت به نسل قبل رقم بزند، اما تراشه‌ی کوالکام در بخش عملکرد CPU ما را ناامید می‌کند و فقط ۸ درصد بهبود را برای فولد جدید به همراه دارد. ظرفیت باتری گلکسی زد فولد ۴ نسبت به زد فولد ۳ تغییری نکرده است و نسل جدید هم با همان باتری ۴۴۰۰ میلی‌آمپرساعتی به دست کاربران می‌رسد. زد فولد ۴ از شارژ سریع ۲۵ واتی، شارژ بی‌سیم ۱۵ واتی و شارژر معکوس ۴٫۵ وات پشتیبانی می‌کند. سامسونگ می‌گوید که شارژر سریع ۲۵ وات می‌تواند باتری زد فولد ۴ را در مدت ۳۰ دقیقه، ۵۰ درصد شارژ کند. اندازه‌گیری‌های انجام‌شده نشان می‌دهند که برای شارژ کاملاً باتری زد فولد ۴ با شارژر ۲۵ واتی حدود یک ساعت و ۲۰ دقیقه زمان نیاز است. کمی از تسکبار فاصله بگیریم و به دیگر ویژگی‌های جذاب رابط‌کاربری گلکسی زد فولد ۴ سامسونگ بپردازیم. به‌صورت پیش‌فرض، سامسونگ استفاده از سه‌ دکمه کلاسیک اندروید را پیشنهاد می‌کند؛ اما همچنان می‌توانید همانند دیگر دستگاه‌های اندرویدی ژست‌های حرکتی را نیز فعال کنید. با توجه به تجربه استفاده از گلکسی فولد در این حالت راحت‌تر و مدرن‌تر به‌نظر می‌رسد.
ویژگی Flex Mode که اولین بار در گلکسی زد فولد ۲ معرفی شده بود، حالا پیشرفته‌تر از قبل شده است. به‌طوری که در اپلیکیشن دوربین، می‌توانید با خم کردن دستگاه حالت Flex Mode را فعال کنید تا در زمان زوم بالای ۲۰ برابر، محل زوم در سمت چپ به‌ شما نمایش داده شود.
یکی دیگر از ویژگی‌هایی که درحال‌حاضر تنها در نسخه بتا One UI 5 حضور دارد، ویژگی Extract Text است که در کیبورد، اپلیکیشن گالری و اپلیکیشن دوربین می‌توان به‌ آن دسترسی داشت. همان‌طورکه از نامش پیدا است، این ویژگی به کاربر کمک می‌کند تا از دل عکس‌ها، متن‌های مورد نظر خود را استخراج کند. البته با وجود اینکه نرم‌افزار، متن‌های فارسی را به‌عنوان «متن» تشخیص می‌دهد، اما همچنان با کپی کردن به حروف انگلیسی ناخوانا خواهید رسید. درنتیجه متأسفانه Extract Text از زبان فارسی پشتیبانی نمی‌کند. گلکسی زد فولد ۴ به‌لطف رابط کاربری پخته‌ترش و سابقه‌ی بیشتر سامسونگ در دنیای گوشی‌های تاشدنی، برای کسانی که به‌دنبال ماجراجویی هستند و صدالبته به‌لحاظ مالی نیز محدودیتی ندارند، کماکان گزینه‌ی مطمئن‌تری به‌حساب می‌آید؛ اما واقعیت آن است که دیگر مانند چهار سال پیش، سامسونگ یکه‌تاز تاشدنی‌ها نیست.
بعد از قریب به چهار سال تکرار و بالغ‌تر کردن طراحی، وقت آن فرا رسیده است تا سامسونگ بار دیگر خطر کند و تغییرات بنیادی‌تری در دستگاه تاشدنی گلکسی زد فولد ایجاد کند. رقبایی همچون میت ایکس اس ۲ و میکس فولد ۲ با وجود آنکه کماکان به‌لحاظ نرم‌افزاری به‌اندازه‌ی تاشدنی سامسونگ پخته نیستند؛ اما نسبت تصویر معقول‌تری در حالت تاشده فراهم می‌آورند، شکافی در حالت تاشده ندارند، ضخامت کمتر و دوربین کارآمدتری دارند.
سامسونگ برای تحکیم جایگاهش در بازار نوظهور تاشدنی‌ها، باید در نسل بعدی از حرکت دست‌به‌عصا و محتاطانه دست بردارد.`,
    Specifications: {
      cpu: {
        model: "پردازنده / Qualcomm SM8475 Snapdragon 8+",
        score: 9,
      },
      screen: { size: "سایز صفحه نمایش / 	7.6 اینچ", score: 8.8 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 8.7 },
      ram: { capacity: "رم / 12 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 50 مگاپیکسل", score: 9.1 },
      storage: { capacity: "حافظه داخلی / 1 ترابایت", score: 8.9 },
      battery: { capacity: "باتری / 4000 میلی آمپر ساعت", score: 9 },
    },
    comments: [
      {
        star: 5,
        userName: "علیرضا",
        date: "پنجشنبه 5 آذر 1400",
        text: "یه روز میخرمت جذاب لنعتی !",
        like: 10,
        dislike: 1,
        positivePoints: ["باطری عالی", "دوربین فوق العاده"],
        negativePoints: ["خیلی گرونه"],
        reply: "انشالله عزیز 🙏🌹",
      },
      {
        star: 4,
        userName: "محمد مهدی",
        date: "سه شنبه 5 آبان 1400",
        text: "من گرفتم فوق العادست... \n ممنون از سایت و ارسال سریع شما",
        like: 7,
        dislike: 2,
        positivePoints: ["صفحه نمایش خفن", "جذاب"],
        negativePoints: ["قیمت بالا"],
        reply: "مبارکتون باشه ",
      },
      {
        star: 3,
        userName: "آیدا رضایی",
        date: "جمعه 17 دی 1400",
        text: "من سفارش دادم ولی هنوز دستم نرسیده :(",
        like: 12,
        dislike: 4,
        reply: "صبور باشید فردا دستتون میرسه آیدای عزیز",
      },
    ],
  },
  //SPEAKERS
  //SPEAKERS
  //SPEAKERS
  {
    id: 6,
    quantity: 1,
    category: "speakers",
    title: "پارتی باکس",
    price: 5200000,
    imageURL: partyBox,
    Specifications: {
      speaker: "ابعاد اسپیکر / 290x260x670",
      ram: "میکروفون / دارد",
      camera: "رقص نور / دارد",
      storage: "نوع حافظه / حافظه داخلی فلش",
      battery: "کارکرد باتری / 6 ساعت",
    },
  },
  //HEADPHONES
  //HEADPHONES
  //HEADPHONES
  {
    id: 7,
    quantity: 1,
    category: "headphones",
    title: "هدفون بی سیم AirPods Pro",
    price: 5795000,
    imageURL: airpodsPro,
    Specifications: {
      speaker: "نوع اتصال / بی سیم",
      ram: "رنگ / سفید",
      camera: "میکروفون / دارد ",
      storage: "کنترل کننده صدا / دارد",
      battery: "طریقه شارژ / از طریق محفظه",
    },
  },
  //CONSOLES
  //CONSOLES
  //CONSOLES
  {
    id: 8,
    quantity: 1,
    category: "consoles",
    title: "کنسول بازی Play Station 5",
    price: 22399000,
    imageURL: ps5,
    technicalCheck: `سونی در مقایسه با مایکروسافت، رفتار محتاط‌تری در قبال معرفی پلی استیشن 5 داشت. هرچند خبر ساخته شدن کنسول از مدت‌ها قبل اعلام شده بود، اما درحالی‌که از زمان مراسم The Game Awards 2019 با ظاهر ایکس باکس سری ایکس آشنا شده بودیم، سونی اولین‌بار خرداد سال گذشته و در جریان رویدادی که هدفش معرفی بازی‌های این کنسول بود، رسما از ظاهر پلی استیشن 5 رونمایی کرد. پلی استیشن 5 در دو مدل معمولی و دیجیتالی رونمایی شد که تنها تفاوت آن‌ها، به پشتیبانی از دیسک‌های فیزیکی مربوط می‌شود و درحالی‌که خریداران مدل معمولی امکان تجربه بازی‌های فیزیکی را خواهند داشت، مدل دیجیتال فاقد این ویژگی خواهد بود و به همین دلیل قیمت پایین‌تری هم دارد که در ادامه بیشتر از آن خواهیم گفت.  پلی استیشن ۵ فعلا در مدلی با رنگ غالب سفید معرفی شده است. قسمت‌های کناری کنسول کاملا سفید رنگ هستند و در وسط آن‌ها، شاهد قسمتی مشکی‌رنگ هم هستیم که در زمان روشن بودن کنسول، نوار باریکی از نور آبی رنگ هم در طرفین این قسمت دیده می‌شود. پلی استیشن 5، سه پورت USB-A دارد که یک عدد از آن‌ها در قسمت جلوی کنسول و دو عدد دیگر هم در پشت آن قرار دارند. همینطور یک پورت USB-C هم در قسمت جلوی کنسول تعبیه شده و پورت LAN و HDMI هم در پشت کنسول قرار دارند.  اولین وسیله، دوربین پلی استیشن 5 است که HD Camera نام دارد و با داشتن دو لنز 1080p، وسیله‌ای شدیدا کاربردی برای استریمر‌ها خواهد بود. درکنار دوربین، نسل جدید هدست‌های سونی هم برای پلی استیشن ۵ معرفی شده که Pulse 3D نام دارد. این هدست بی‌سیم، در راس تمام ویژگی‌هایش از صدای سه‌بعدی پشتیبانی می‌کند که سونی تا امروز مانور زیادی روی تاثیرگذاری آن در بازی‌ها داشته و اعلام کرده که این ویژگی، باعث خواهد شد تا کاربران بیشتر از هر زمان دیگری غرق تجربه بازی شوند. هدست جدید سونی همینطور از میکروفونی با پشتیبانی از نویز کنسلینگ استفاده می‌کند تا با حذف صداهای اضافی اطراف، صدای شما را به‌صورت شفاف و دقیق منتقل کند. 
یک ریموت به اسم Media Remote که برای کنترل محتوای صوتی و تصویری کاربرد دارد و از یک میکروفون داخلی هم برای دریافت فرمان‌های صوتی استفاده می‌کند و همینطور پایه مخصوص شارژ دسته‌ها هم دیگر لوازمی هستند که برای PS5 عرضه شده‌اند. پلی استیشن ۵ همزمان با عرضه جهانی در ایران نیز عرضه شد و این روز‌ها هر دو مدل دیجیتال و فیزیکی آن قیمتی بالاتر از ۲۰ میلیون دارند. این مساله البته کاملا ناشی از اتفاقات داخلی نیست و به دلیل کمبود موجودی جهانی کنسول، حتی در برخی کشور‌های دیگر هم خرید آن با قیمت ۵۰۰ و ۴۰۰ دلار ممکن نیست و بخشی از غیرمتعارف بودن قیمت داخلی هم همین مساله است. انتظار می‌رود در آینده و با بهبود وضعیت میزان عرضه جهانی، قسمت کنسول در داخل کشور هم به قیمت معادل دلاری آن نزدیک‌تر شود. هرچند که به‌هیچ وجه نمی‌توان پیش‌بینی دقیقی در این مورد داشت. سته پلی استیشن ۵ بزرگ‌تر و سنگین‌تر از دسته پلی استیشن ۴ است که البته به‌نظر می‌رسد به‌لطف همین ویژگی‌ها و صد البته توجه به طراحی ارگونومیک، شاهد کنترلر خوش‌دست‌تری در مقایسه با نسل قبل هستیم. هرچند لوگو‌های همیشگی سونی و اشکال هندسی چهارگانه دوست‌داشتنی این شرکت روی کلید‌های دوال سنس هم حک شده‌اند، اما سونی این بار سراغ طراحی آن‌ها به شکل بی‌رنگ رفته که ظاهر خاصی به این کنترلر سفید‌رنگ بخشیده است. سونی اخیرا به صورت رسمی دسته PS5 مشکی و دسته PS5 قرمز را نیز معرفی کرده است که به ترتیب با قیمت ۷۰ و ۷۵ دلار عرضه می‌شوند. 
علاوه بر موارد ظاهری، دوال سنس قرار است از نظر عملکرد هم تجربه‌ای نسل نهمی ارائه کند. جدا از اینکه این دسته باتری بهتری در مقایسه با دوال‌شاک ۴ خواهد داشت و شاهد پورت USB-C هم روی آن خواهیم بود، سونی بافت کلی دسته را چه در بدنه خود آن و چه در مواردی مثل آنالوگ‌ها و تریگر‌ها به‌شکلی طراحی کرده که دسته راحت‌تر از نسل قبلی دسته‌های سونی در دست قرار بگیرد. همچنین حساسیت بالاتر تریگر‌ها، یکی دیگر از مواردی است که نتیجه آن، تاثیرگذاری به مراتب بیش‌تر فشار وارد‌شده به تریگر در اعمال دستور‌ها در بازی خواهد بود. سونی این مورد را به کشیدن زه یک کمان تشبیه کرده که شما می‌توانید با فشار دلخواه، آن را به میزان دلخواه بکشید. البته این مورد خیلی هم ویژگی جدیدی نیست و قبلا هم در بازی‌ها استفاده شده بود ولی خب قرار است دقت آن در دوال سنس به مراتب بیش‌تر باشد. `,
    Specifications: {
      cpu: "پردازنده / 8 هسته ای ذن",
      ram: "حافظه رم / 16 گیگابایت رم",
      camera: "خروجی تصویر / 4K , 8K",
      storage: "حافظه داخلی / 825 گیگابایت",
      Weight: "وزن / 4.5 کیلوگرم",
    },
    comments: [
      {
        star: 5,
        userName: "پارسا رضایی",
        date: "پنجشنبه 8 بهمن 1400",
        text: "اگه قصد خرید دارید کنسول فوق العاده ای هست... راضیتون میکنه!",
        like: 20,
        dislike: 5,
        positivePoints: ["کیفیت عالی"],
        negativePoints: ["قیمت بالاست"],
        reply: "بله کنسول خوبی هست",
      },
      {
        star: 4,
        userName: "سارا",
        date: "سه شنبه 5 آبان 1400",
        text: "هرکی گرفته خوشبحالش :)",
        like: 7,
        dislike: 1,
        positivePoints: ["جذاب لعنتیه"],
        negativePoints: ["قیمت بالا"],
        reply: "انشالله شماهم میگیرید عزیز",
      },
      {
        star: 5,
        userName: "مژده حبیبی",
        date: "شنبه 17 اسفند 1400",
        text: "بزودی سفارش میدم",
        like: 5,
        dislike: 4,
        reply: "💜🌹",
      },
    ],
  },
  {
    id: 9,
    quantity: 1,
    category: "consoles",
    title: "کنسول بازی Xbox Seires s",
    price: 10170000,
    imageURL: xboxSeriesS,
    Specifications: {
      cpu: "پردازنده / شخصی سازی شده Zen2",
      ram: "حافظه رم / 10 گیگابایت رم",
      camera: "خروجی تصویر / QHD",
      storage: "حافظه داخلی / 500 گیگابایت SSD",
      Weight: "وزن / 1.93 کیلوگرم",
    },
  },
  {
    id: 10,
    quantity: 1,
    category: "consoles",
    title: "کنسول بازی Play Station 4",
    price: 15750000,
    imageURL: ps4,
    Specifications: {
      cpu: "پردازنده / 8 هسته ای AMD",
      ram: "حافظه رم / 8 گیگابایت رم",
      camera: "خروجی تصویر / 1080p",
      storage: "حافظه داخلی / 500 گیگابایت",
      Weight: "وزن / 2.08 کیلوگرم",
    },
  },
  {
    id: 11,
    quantity: 1,
    category: "consoles",
    title: "کنسول بازی Xbox وان اس",
    price: 8300000,
    imageURL: xboxOneS,
    Specifications: {
      cpu: "پردازنده / 8 هسته ای AMD",
      ram: "حافظه رم / 8 گیگابایت رم",
      camera: "خروجی تصویر / 4K",
      storage: "حافظه داخلی / 1 ترابایت",
      Weight: "وزن / 2.9 کیلوگرم",
    },
  },
  //LAPTOPS
  //LAPTOPS
  //LAPTOPS
  {
    id: 12,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Asus ROG Strix",
    price: 39648000,
    cpuCompany: 0,
    cpuModel: 1,
    ram: 32,
    ramModel: 0,
    storage: 1000,
    storageModel: 1,
    imageURL: asusRogStrix,
    technicalCheck: `شاید در میان انبوه لپ‌تاپ‌های گیمینگ ایسوس که در بین آن‌ها محصولات پرقدرتی همچون Strix Scar یا سری Zephyrus S با سخت‌افزار دیوانه‌وار و برچسب‌های قیمتی نجومی‌شان نگاه‌ها را به خود خیره می‌کنند، دستگاه‌های سری Strix G کمتر به‌چشم بیایند؛ اما امسال به‌لطف عملکرد شگفت‌انگیز پردازنده‌‌‌ی Ryzen 9 5900HX در دل لپ‌تاپ‌های جدید Strix G513، وضعیت کمی به سود خانواده‌ی میان‌رده‌ی Strix G تغییر کرده است.
لپ‌تاپ‌های Strix G513 چندین عضو با پردازنده‌های Ryzen 9 5900HX و Ryzen 7 4800H به‌همراه گرافیک‌های RTX 3050، RTX 3060 و RTX 3070 وجود دارد؛ اما شاید جذاب‌ترین و ارزشمندترین مدل در میان آن‌ها، یکی از مدل‌های میانی موسوم به Strix G513QM با پردازنده‌ی پرقدرت Ryzen 9 و گرافیک RTX 3060 باشد. این لپ‌تاپ به‌ویژه در نسخه‌ی Full-HD در ترکیب با باتری بسیار حجیم ۹۰ وات‌ساعتی‌اش، حداقل روی کاغذ، جزو معدود لپ‌تاپ‌های گیمینگی به‌شمار می‌آید که حداقل در کاربری‌های روزمره، می‌توان به «قابلیت حمل» آن اتکا داشت. دریایی از نورپردازی رنگارنگ RGB، لوگوی براق ROG و تضاد رنگی بدنه؛ تایوانی‌ها با زبان طراحی Strix G15 به بهترین شکل ممکن به هدف خود در جلب توجه گیمرها می‌رسند؛ تقریبا تمام خوره‌های بازی در زومیت و زومجی، همین نظر را در مورد Strix G15 داشتند. ایسوس لپ‌تاپ Strix G15 را در سه گزینه‌ی رنگی Stealthy Original Black و Eclipse Gray و Electro Punk به‌فروش می‌رساند که مورد نخست و دوم با تضادهای رنگی مشکی و قرمز برای کاربران جوان‌تر و مورد دوم با تضاد رنگی مشکی/خاکستری برای گیمرهای جاافتاده‌تر انتخاب مناسبی به‌شمار می‌آیند. علاوه‌بر نورپردازی مجزای هرکدام از کلیدهای کیبورد، نواری از چراغ‌های LED در سه لبه‌ی Strix G15 نیز وجود دارد. شما می‌توانید جلوه‌ی نورپردازی هرکدام از نواحی RGB را با تنظیمات Aura Sync در نرم‌افزار Armoury Crate ایسوس، به‌دلخواه خود شخصی‌سازی کنید. ما وجود نوار LED در لبه‌های لپ‌تاپ را چندان جالب نمی‌دانیم؛ اما جامعه‌ی مخاطبان این لپ‌تاپ که گیمرها هستند، با ما هم‌نظر نباشند. متأسفانه نورپردازی نوار LED اطراف لپ‌تاپ و کلیدهای کیبورد مستقل از هم نیستند و برای خاموش‌کردن آن باید نور پس‌زمینه‌ی کیبورد را خاموش کنید. طراحان ایسوس قاب پشتی نمایشگر و لولاهای Strix G15 را از جنس فلز و باقی بدنه را از جنس پلاستیک انتخاب کرده‌اند؛ البته نباید مأیوس باشید؛ چرا‌که دستگاه کیفیت ساخت بسیار بالایی دارد و به هیچ‌وجه حس‌وحال کالایی ارزان‌قیمت یا بی‌کیفیت را القا نمی‌کند. ایسوس می‌گوید استفاده از پلاستیک در محل استراحت دست از انتقال حرارت به دستان کاربر جلوگیری می‌کند. Strix G15 با وزن ۲٫۳۰ کیلوگرمی‌اش به‌اندازه‌ی اولترابوک‌های سبک‌وزن یک کیلوگرمی قابل‌حمل نیست؛ اما باتوجه به قدرت پردازشی فوق‌العاده و نمایشگر ۱۵٫۶ اینچی‌اش، می‌توانیم از سنگینی وزنش چشم‌پوشی کنیم. 
با باز کردن درِ لپ‌تاپ، با حاشیه‌های بسیار باریک کناری و بالایی صفحه‌‌نمایش ماتِ Strix G15، نوشته‌های ریز ROG‌ در گوشه‌‌ای از پایه، ترک‌پد بسیار بزرگ و نورپردازی RGB کیبورد مواجه خواهید شد. تایوانی‌ها ابعاد نسل جدید Strix G15 را ۷ درصد کاهش داده‌اند و با باریک‌تر کردن حاشیه‌ها، نسبت صفحه‌نمایش به بدنه را به عدد بسیار خوب ۸۵ درصد رسانده‌اند. ای کاش ایسوس به‌جای استفاده از نمایشگر عریضِ ۱۶:۹، پنل بلندتری با نسبت تصویر ۳:۲ یا ۱۶:۱۰ به‌کار می‌برد تا ضخامت حاشیه‌ی قطور پایین نیز کاهش یابد. ایسوس لپ‌تاپ Strix G15 G513QM را با یکی از دو پنل ۱۵٫۶ اینچی QHD و Full-HD به‌فروش می‌رساند؛ هر دو پنل از نوع IPS با زمان پاسخگویی ۳ میلی‌ثانیه‌ای هستند؛ اما نمونه‌ی QHD فضای وسیع DCI-P3 را به‌صورت کامل پوشش داده و نرخ نوسازی ۱۶۵ هرتزی را ارائه می‌دهد، درحالی‌که نمونه‌ی Full-HD از نرخ نوسازی ۳۰۰ هرتزی را دراختیارتان می‌گذارد و پوشش کاملی از فضای رنگی sRGB دارد. متأسفانه گرافیک یکپارچه‌ی موجود در تراشه‌ی Ryzen 9 5900HX به‌جای معماری جدید RDNA2 از ۸ هسته‌ی پردازشی با معماری قدیمی Vega و فرکانس بیشینه‌ی ۲۱۰۰ مگاهرتز استفاده می‌کند. طبیعتا ایسوس به این ماژول اکتفا نکرده و لپ‌تاپ گیمینگ خود را به گرافیک مجزای NVIDIA RTX 3060 مجهز کرده است.
انویدیا گرافیک RTX 3060 نسخه‌ی موبایل را در ۱۱ مدل مختلف با فرکانس‌های متفاوت و توان مصرفی ۶۰ تا ۱۱۵ وات دراختیار تولیدکنندگان قرار می‌دهد؛ ایسوس قدرتمندترین نمونه‌ی موجود را با توان مصرفی ۱۱۵ وات در لپ‌تاپ Strix G15 به‌کار می‌گیرد و می‌گوید به‌کمک فناوری Dynamic Boost، هنگام اتصال لپ‌تاپ به پریز برق، توان بالغ‌بر ۱۳۰ وات را نیز به این گرافیک اختصاص می‌دهد.
پردازنده‌ی گرافیکی ۱۱۵ واتی RTX 3060 با فرکانس پایه‌ی ۱۳۸۷ مگاهرتز از ۳۸۴۰ هسته‌ی Cuda بهره می‌برد، حافظه‌ی ۶ گیگابایتی GDDR6-اش با باس ۱۹۲ بیتی و فرکانس ۱۷۵۰ مگاهرتزی به پهنای باند ۳۳۶ گیگابایت‌برثانیه دست می‌یابد و توان محاسباتی آن با دقت FP32 به ۱۰٫۷ ترافلاپس می‌رسد که روی کاغذ از سطح عملکرد گرافیک پرقدرت RTX 2070 Super بسیار فراتر است. از بین انبوه لپ‌تاپ‌های گیمینگ بازار، Strix G513QM یکی از معدود مدل‌هایی به‌شمار می‌آید که مجموعه‌ای از قطعات توانمند را با نقص‌های اندک کنار هم آورده است. پردازنده‌ی پرقدرت Ryzen 9 5900HX چه در حالت Plugged، چه Unplugged عملکرد کم‌نظیری را با پایداری بسیار خوب ارائه می‌دهد، نسخه‌ی ۱۱۵ واتی RTX 3060 در ترکیب با نمایشگر ۳۰۰ هرتزی دستگاه، امکان اجرای مطلوب عموم بازی‌ها را فراهم می‌کند و اسپیکرها با تفکیک بسیار خوب صدا و بیس‌های عمیق، تجربه‌ی موسیقایی لذت‌بخشی را ارائه می‌دهند.`,
    Specifications: {
      cpu: "پردازنده / اینتل core i7",
      ram: "حافظه رم / 32 گیگابایت رم",
      gpu: "گرافیک / انویدیا GTX 1650Ti",
      storage: "حافظه داخلی / 1 ترابایت",
      Weight: "وزن / 2.39 کیلوگرم",
    },
    comments: [
      {
        star: 5,
        userName: "محمدرضا",
        date: "دوشنبه 8 آذر 1400",
        text: "فوق العادست دوستان !",
        like: 15,
        dislike: 2,
        positivePoints: ["رنگارنگ و باحاله", "قدرت پردازش بالا"],
        negativePoints: ["وزنش یکم سنگینه"],
        reply: "مبارکتون باشه محمدرضای عزیز",
      },
      {
        star: 5,
        userName: "تانیا",
        date: "یکشنبه 5 دی 1400",
        text: "خیلی قشنگه...",
        like: 7,
        dislike: 2,
        positivePoints: ["قدرتمند", "جذاب"],
        reply: "بله همینطوره ",
      },
      {
        star: 5,
        userName: "مجتبی محمدی",
        date: "شنبه 4 دی 1400",
        text: "من سفارش دادم به موقع به دستم رسید تشکر از سایت عالی شما",
        like: 12,
        dislike: 4,
        reply: "خوشحالیم که رضایت دارید 💜",
      },
    ],
  },
  {
    id: 13,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Macbook air 2020",
    price: 32599000,
    cpuCompany: 1,
    cpuModel: 2,
    ram: 8,
    ramModel: 1,
    storage: 256,
    storageModel: 1,
    imageURL: macbookAir2020,
    Specifications: {
      cpu: "پردازنده / 8 هسته ای Apple M1",
      ram: "حافظه رم / 8 گیگابایت رم",
      gpu: "گرافیک / 7 هسته ای",
      storage: "حافظه داخلی / 256 گیگابایت",
      Weight: "وزن / 1.29 کیلوگرم",
    },
  },
  {
    id: 14,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Asus TUF dash F15",
    price: 42899000,
    cpuCompany: 0,
    cpuModel: 1,
    ram: 16,
    ramModel: 0,
    storage: 1000,
    storageModel: 1,
    imageURL: asusTufDashF15,
    Specifications: {
      cpu: "پردازنده / اینتل core i7",
      ram: "حافظه رم / 16 گیگابایت رم",
      gpu: "گرافیک / انویدیا RTX 3060",
      storage: "حافظه داخلی / 1 ترابایت",
      Weight: "وزن / 2 کیلوگرم",
    },
  },
  {
    id: 15,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Asus TUF Gaming F15",
    price: 23899000,
    cpuCompany: 0,
    cpuModel: 4,
    ram: 8,
    ramModel: 0,
    storage: 1000,
    storageModel: 0,
    imageURL: asusGaming,
    Specifications: {
      cpu: "پردازنده / اینتل core i5",
      ram: "حافظه رم / 8 گیگابایت رم",
      gpu: "گرافیک / انویدیا GTX 1650 Ti",
      storage: "حافظه داخلی / 1256 گیگابایت",
      Weight: "وزن / 2.3 کیلوگرم",
    },
  },
  {
    id: 16,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Zenbook duo",
    price: 49199000,
    cpuCompany: 0,
    cpuModel: 1,
    ram: 16,
    ramModel: 2,
    storage: 1000,
    storageModel: 1,
    imageURL: zenBook,
    Specifications: {
      cpu: "پردازنده / اینتل core i7",
      ram: "حافظه رم / 16 گیگابایت رم",
      gpu: "گرافیک / انویدیا GeForce MX450",
      storage: "حافظه داخلی / 1 ترابایت",
      Weight: "وزن / 1.5 کیلوگرم",
    },
  },
  {
    id: 17,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Lenovo Thinkbook",
    price: 14800000,
    cpuCompany: 0,
    cpuModel: 0,
    ram: 8,
    ramModel: 0,
    storage: 256,
    storageModel: 1,
    imageURL: thinkBook,
    Specifications: {
      cpu: "پردازنده / اینتل core i5",
      ram: "حافظه رم / 8 گیگابایت رم",
      gpu: "گرافیک / 2 گیگابایت از نوع GDDR5",
      storage: "حافظه داخلی / 1 ترابایت",
      Weight: "وزن / 1.7 کیلوگرم",
    },
  },
];

export const filters = {
  phones: [
    {
      title: "سیستم عامل",
      options: [
        { title: "IOS", key: "system_0" },
        { title: "اندروید", key: "system_1" },
      ],
      key: "system",
    },
    {
      title: "دوربین",
      options: [
        { title: "12 مگاپیکسل", key: "camera_12" },
        { title: "48 مگاپیکسل", key: "camera_48" },
        { title: "50 مگاپیکسل", key: "camera_50" },
        { title: "64 مگاپیکسل", key: "camera_64" },
        { title: "108 مگاپیکسل", key: "camera_108" },
        { title: "200 مگاپیکسل", key: "camera_200" },
      ],
      key: "camera",
    },
    {
      title: "حافظه داخلی",
      options: [
        { title: "128 گیگابایت", key: "storage_128" },
        { title: "256 گیگابایت", key: "storage_256" },
        { title: "512 گیگابایت", key: "storage_512" },
      ],
      key: "storage",
    },
    {
      title: "حافظه رم",
      options: [
        { title: "3 گیگابایت", key: "ram_3" },
        { title: "4 گیگابایت", key: "ram_4" },
        { title: "6 گیگابایت", key: "ram_6" },
        { title: "8 گیگابایت", key: "ram_8" },
        { title: "12 گیگابایت", key: "ram_12" },
      ],
      key: "ram",
    },
    {
      title: "باتری",
      options: [
        { title: "3000 میلی آمپر ساعت", key: "battery_3000" },
        { title: "4000 میلی آمپر ساعت", key: "battery_4000" },
        { title: "5000 میلی آمپر ساعت", key: "battery_5000" },
        { title: "6000 میلی آمپر ساعت", key: "battery_6000" },
      ],
      key: "battery",
    },
    {
      title: "تعداد سیمکارت",
      options: [
        { title: "1 عدد", key: "simcard_1" },
        { title: "2 عدد", key: "simcard_2" },
      ],
      key: "simcard",
    },
  ],
  tablets: [
    {
      title: "تعداد سیمکارت",
      options: [
        { title: "1 عدد", key: "simcard_1" },
        { title: "2 عدد", key: "simcard_2" },
      ],
      key: "simcard",
    },
    {
      title: "دوربین",
      options: [
        { title: "12 مگاپیکسل", key: "camera_12" },
        { title: "48 مگاپیکسل", key: "camera_48" },
        { title: "50 مگاپیکسل", key: "camera_50" },
        { title: "64 مگاپیکسل", key: "camera_64" },
        { title: "108 مگاپیکسل", key: "camera_108" },
      ],
      key: "camera",
    },
    {
      title: "حافظه داخلی",
      options: [
        { title: "128 گیگابایت", key: "storage_128" },
        { title: "256 گیگابایت", key: "storage_256" },
        { title: "512 گیگابایت", key: "storage_512" },
      ],
      key: "storage",
    },
    {
      title: "حافظه رم",
      options: [
        { title: "3 گیگابایت", key: "ram_3" },
        { title: "4 گیگابایت", key: "ram_4" },
        { title: "6 گیگابایت", key: "ram_6" },
        { title: "8 گیگابایت", key: "ram_8" },
        { title: "12 گیگابایت", key: "ram_12" },
      ],
      key: "ram",
    },
    {
      title: "سیستم عامل",
      options: [
        { title: "IOS", key: "system_0" },
        { title: "اندروید", key: "system_1" },
      ],
      key: "system",
    },
    {
      title: "باتری",
      options: [
        { title: "3000 میلی آمپر ساعت", key: "battery_3000" },
        { title: "4000 میلی آمپر ساعت", key: "battery_4000" },
        { title: "5000 میلی آمپر ساعت", key: "battery_5000" },
        { title: "6000 میلی آمپر ساعت", key: "battery_6000" },
      ],
      key: "battery",
    },
  ],
  laptops: [
    {
      title: "سازنده پردازنده",
      options: [
        { title: "Intel", key: "cpuCompany_0" },
        { title: "Apple", key: "cpuCompany_1" },
        { title: "AMD", key: "cpuCompany_2" },
      ],
      key: "cpuCompany",
    },
    {
      title: "سری پردازنده",
      options: [
        { title: "Core i3", key: "cpuModel_0" },
        { title: "Core i7", key: "cpuModel_1" },
        { title: "Core i5", key: "cpuModel_4" },
        { title: "M1", key: "cpuModel_2" },
        { title: "Ryzen 5", key: "cpuModel_3" },
      ],
      key: "cpuModel",
    },
    {
      title: "حافظه رم",
      options: [
        { title: "4 گیگابایت", key: "ram_4" },
        { title: "8 گیگابایت", key: "ram_8" },
        { title: "16 گیگابایت", key: "ram_16" },
        { title: "32 گیگابایت", key: "ram_32" },
      ],
      key: "ram",
    },
    {
      title: "نوع حافظه رم",
      options: [
        { title: "DDR4", key: "ramModel_0" },
        { title: "Unified", key: "ramModel_1" },
        { title: "LPDDR4X", key: "ramModel_2" },
      ],
      key: "ramModel",
    },
    {
      title: "حافظه داخلی",
      options: [
        { title: "256 گیگابایت", key: "storage_256" },
        { title: "512 گیگابایت", key: "storage_512" },
        { title: "1 ترابایت", key: "storage_1000" },
      ],
      key: "storage",
    },
    {
      title: "نوع حافظه داخلی",
      options: [
        { title: "هارد دیسک", key: "storageModel_0" },
        { title: "SSD", key: "storageModel_1" },
      ],
      key: "storageModel",
    },
  ],
  consoles: [
    {
      title: "سازنده پردازنده",
      options: [
        { title: "Intel", key: "cpuCompany_0" },
        { title: "Apple", key: "cpuCompany_1" },
        { title: "AMD", key: "cpuCompany_2" },
      ],
      key: "cpuCompany",
    },
    {
      title: "سری پردازنده",
      options: [
        { title: "Core i3", key: "cpuModel_0" },
        { title: "Core i7", key: "cpuModel_1" },
        { title: "Core i5", key: "cpuModel_4" },
        { title: "M1", key: "cpuModel_2" },
        { title: "Ryzen 5", key: "cpuModel_3" },
      ],
      key: "cpuModel",
    },
    {
      title: "حافظه رم",
      options: [
        { title: "4 گیگابایت", key: "ram_4" },
        { title: "8 گیگابایت", key: "ram_8" },
        { title: "16 گیگابایت", key: "ram_16" },
        { title: "32 گیگابایت", key: "ram_32" },
      ],
      key: "ram",
    },
    {
      title: "نوع حافظه رم",
      options: [
        { title: "DDR4", key: "ramModel_0" },
        { title: "Unified", key: "ramModel_1" },
        { title: "LPDDR4X", key: "ramModel_2" },
      ],
      key: "ramModel",
    },
    {
      title: "حافظه داخلی",
      options: [
        { title: "256 گیگابایت", key: "storage_256" },
        { title: "512 گیگابایت", key: "storage_512" },
        { title: "1 ترابایت", key: "storage_1000" },
      ],
      key: "storage",
    },
    {
      title: "نوع حافظه داخلی",
      options: [
        { title: "هارد دیسک", key: "storageModel_0" },
        { title: "SSD", key: "storageModel_1" },
      ],
      key: "storageModel",
    },
  ],
  headphones: [
    {
      title: "سازنده پردازنده",
      options: [
        { title: "Intel", key: "cpuCompany_0" },
        { title: "Apple", key: "cpuCompany_1" },
        { title: "AMD", key: "cpuCompany_2" },
      ],
      key: "cpuCompany",
    },
    {
      title: "سری پردازنده",
      options: [
        { title: "Core i3", key: "cpuModel_0" },
        { title: "Core i7", key: "cpuModel_1" },
        { title: "Core i5", key: "cpuModel_4" },
        { title: "M1", key: "cpuModel_2" },
        { title: "Ryzen 5", key: "cpuModel_3" },
      ],
      key: "cpuModel",
    },
    {
      title: "حافظه رم",
      options: [
        { title: "4 گیگابایت", key: "ram_4" },
        { title: "8 گیگابایت", key: "ram_8" },
        { title: "16 گیگابایت", key: "ram_16" },
        { title: "32 گیگابایت", key: "ram_32" },
      ],
      key: "ram",
    },
    {
      title: "نوع حافظه رم",
      options: [
        { title: "DDR4", key: "ramModel_0" },
        { title: "Unified", key: "ramModel_1" },
        { title: "LPDDR4X", key: "ramModel_2" },
      ],
      key: "ramModel",
    },
    {
      title: "حافظه داخلی",
      options: [
        { title: "256 گیگابایت", key: "storage_256" },
        { title: "512 گیگابایت", key: "storage_512" },
        { title: "1 ترابایت", key: "storage_1000" },
      ],
      key: "storage",
    },
    {
      title: "نوع حافظه داخلی",
      options: [
        { title: "هارد دیسک", key: "storageModel_0" },
        { title: "SSD", key: "storageModel_1" },
      ],
      key: "storageModel",
    },
  ],
  digitalWatches: [
    {
      title: "سازنده پردازنده",
      options: [
        { title: "Intel", key: "cpuCompany_0" },
        { title: "Apple", key: "cpuCompany_1" },
        { title: "AMD", key: "cpuCompany_2" },
      ],
      key: "cpuCompany",
    },
    {
      title: "سری پردازنده",
      options: [
        { title: "Core i3", key: "cpuModel_0" },
        { title: "Core i7", key: "cpuModel_1" },
        { title: "Core i5", key: "cpuModel_4" },
        { title: "M1", key: "cpuModel_2" },
        { title: "Ryzen 5", key: "cpuModel_3" },
      ],
      key: "cpuModel",
    },
    {
      title: "حافظه رم",
      options: [
        { title: "4 گیگابایت", key: "ram_4" },
        { title: "8 گیگابایت", key: "ram_8" },
        { title: "16 گیگابایت", key: "ram_16" },
        { title: "32 گیگابایت", key: "ram_32" },
      ],
      key: "ram",
    },
    {
      title: "نوع حافظه رم",
      options: [
        { title: "DDR4", key: "ramModel_0" },
        { title: "Unified", key: "ramModel_1" },
        { title: "LPDDR4X", key: "ramModel_2" },
      ],
      key: "ramModel",
    },
    {
      title: "حافظه داخلی",
      options: [
        { title: "256 گیگابایت", key: "storage_256" },
        { title: "512 گیگابایت", key: "storage_512" },
        { title: "1 ترابایت", key: "storage_1000" },
      ],
      key: "storage",
    },
    {
      title: "نوع حافظه داخلی",
      options: [
        { title: "هارد دیسک", key: "storageModel_0" },
        { title: "SSD", key: "storageModel_1" },
      ],
      key: "storageModel",
    },
  ],
  speakers: [
    {
      title: "سازنده پردازنده",
      options: [
        { title: "Intel", key: "cpuCompany_0" },
        { title: "Apple", key: "cpuCompany_1" },
        { title: "AMD", key: "cpuCompany_2" },
      ],
      key: "cpuCompany",
    },
    {
      title: "سری پردازنده",
      options: [
        { title: "Core i3", key: "cpuModel_0" },
        { title: "Core i7", key: "cpuModel_1" },
        { title: "Core i5", key: "cpuModel_4" },
        { title: "M1", key: "cpuModel_2" },
        { title: "Ryzen 5", key: "cpuModel_3" },
      ],
      key: "cpuModel",
    },
    {
      title: "حافظه رم",
      options: [
        { title: "4 گیگابایت", key: "ram_4" },
        { title: "8 گیگابایت", key: "ram_8" },
        { title: "16 گیگابایت", key: "ram_16" },
        { title: "32 گیگابایت", key: "ram_32" },
      ],
      key: "ram",
    },
    {
      title: "نوع حافظه رم",
      options: [
        { title: "DDR4", key: "ramModel_0" },
        { title: "Unified", key: "ramModel_1" },
        { title: "LPDDR4X", key: "ramModel_2" },
      ],
      key: "ramModel",
    },
    {
      title: "حافظه داخلی",
      options: [
        { title: "256 گیگابایت", key: "storage_256" },
        { title: "512 گیگابایت", key: "storage_512" },
        { title: "1 ترابایت", key: "storage_1000" },
      ],
      key: "storage",
    },
    {
      title: "نوع حافظه داخلی",
      options: [
        { title: "هارد دیسک", key: "storageModel_0" },
        { title: "SSD", key: "storageModel_1" },
      ],
      key: "storageModel",
    },
  ],
};
export const bestSellerProducts = [
  {
    id: 1,
    quantity: 1,
    category: "phones",
    title: "موبایل اپل مدل iPhone 13",
    price: 52439000,
    imageURL: iphone13,
    positivePoints: [
      "طراحی زیبا و شیک با بدنه‌ای مقاوم و کاملا ضد آب",
      "صفحه نمایش OLED درخشان با پشتیبانی از HDR10 و Dolby Vision",
      "افزایش ظرفیت باتری و طول عمر آن نسبت به آیفون ۱۲",
      "اسپیکرهای استریوی باکیفیت با بلندی صدای زیاد",
      "پشتیبانی از تکنولوژی 5G",
      "مجهز شدن به برخی از ویژگی‌های آیفون ۱۲ پرو مکس در دوربین اصلی",
      "عملکرد فوق العاده رده بالا و عالی هر سه دوربین در شب و روز",
    ],
    negativePoints: [
      "عدم وجود تحول چندان چشمگیر و بزرگ نسبت به آیفون ۱۲",
      "عدم پشتیبانی از نرخ تازه سازی ۱۲۰ هرتز در صفحه نمایش",
      "سرعت شارژ کم‌تر نسبت به مدل‌های Pro",
      "ادامه وجود ناچ نمایشگر علیرغم کاهش اندازه آن",
    ],
    technicalCheck: `در حالی که بیشتر گوشی‌های اندروید حداکثر تا سه سال میزبان بروزرسانی‌های نرم‌افزاری هستند، اما گوشی آیفون ۱۳ حداقل تا ۵ سال میزبان بروزرسانی‌های iOS خواهد بود. بنابراین، اگر قصد خرید یک گوشی هوشمند با پشتیبانی طولانی‌مدتی داشته باشد، آیفون ۱۳ یکی از بهترین گزینه‌هاست.
با این وجود، اگر قصد خرید گوشی با پشتیبانی از نرخ تازه‌سازی ۱۲۰ هرتزی دارید، آیفون ۱۳ انتخاب خوبی نیست. این گوشی تنها پرچمدار سال ۲۰۲۱ میلادی‌ست که از نمایشگر ۶۰ هرتزی بهره می‌برد و همین موضوع به یکی از نقاط منفی آن تبدیل شده است. البته قدرت سخت‌افزاری و پنل نمایشگر فوق‌العاده می‌تواند این موضوع را جبران کند. اما هستند کسانی که واقعاً به دنبال نمایشگرهای ۱۲۰ هرتزی هستند و نمی‌توانند به سادگی آن را نادیده بگیرند.
آیفون ۱۳ از بسیاری جهات تغییر چندانی با نسل قبل ندارد. با این حال، بیشتر تغییرات و ارتقاء‌ها در داخل گوشی شکل گرفته‌اند. تراشه A15 Bionic یکی از بهترین و سریع‌ترین تراشه‌های دنیاست. دوربین ۱۲ مگاپیکسلی در هر شرایطی عملکرد شگفت‌انگیزی دارد و باتری با دوام بالا از جمله مهم‌ترین تغییرات آیفون ۱۳ محسوب می‌شوند. با این حال، اگر از آیفون ۱۲ استفاده می‌کنید، نیازی به ارتقاء آن ندارید. اگرچه آیفون ۱۳ ویژگی‌هایی دارد که واقعاً عالی‌ست، اما پیشرفت‌های آن دلیل خوبی برای ارتقاء از آیفون ۱۲ محسوب نمی‌شوند و همچنین در این گوشی از یک سنسور ۱۲ مگاپیکسل با تثبیت‌کننده تغییر سنسور استفاده شده که تقریباً در هر سناریویی عکس‌های شگفت‌انگیزی می‌گیرد. آیفون ۱۳ همچنان نسبت به رقبای اندرویدی خود در زمینه فیلمبرداری برتری مشخصی دارد. حالت سینماتیک نیز بسیار کاربردی و حرفه‌ای است , در ضمن، کیفیت ساخت آیفون ۱۳ فوق‌العاده است!`,
    Specifications: {
      cpu: { model: "پردازنده / Apple A15 Bionic", score: 9 },
      screen: { size: "سایز صفحه نمایش / 	6.1 اینچ", score: 8.8 },
      speaker: { model: "اسپیکر / استریو ( دوگانه )", score: 8.7 },
      ram: { capacity: "رم / 4 گیگابایت رم" },
      camera: { quality: "دوربین اصلی / 12 مگاپیکسل", score: 9.1 },
      storage: { capacity: "حافظه داخلی / 256 گیگابایت", score: 8.9 },
      battery: { capacity: "باتری / 3240 میلی آمپر ساعت", score: 9 },
    },
    comments: [
      {
        star: 5,
        userName: "علیرضا",
        date: "پنجشنبه 5 آذر 1400",
        text: "یه روز میخرمت جذاب لنعتی !",
        like: 10,
        dislike: 1,
        positivePoints: ["باطری عالی", "دوربین فوق العاده"],
        negativePoints: ["خیلی گرونه"],
        reply: "انشالله عزیز 🙏🌹",
      },
      {
        star: 4,
        userName: "محمد مهدی",
        date: "سه شنبه 5 آبان 1400",
        text: "من گرفتم فوق العادست... \n ممنون از سایت و ارسال سریع شما",
        like: 7,
        dislike: 2,
        positivePoints: ["صفحه نمایش خفن", "جذاب"],
        negativePoints: ["قیمت بالا"],
        reply: "مبارکتون باشه ",
      },
      {
        star: 3,
        userName: "آیدا رضایی",
        date: "جمعه 17 دی 1400",
        text: "من سفارش دادم ولی هنوز دستم نرسیده :(",
        like: 12,
        dislike: 4,
        reply: "صبور باشید فردا دستتون میرسه آیدای عزیز",
      },
    ],
  },
  {
    id: 2,
    quantity: 1,
    category: "phones",
    title: " موبایل سامسونگ Galaxy s21",
    price: 37199000,
    imageURL: galaxyS21,
    technicalCheck: `در بخش طراحی به نظر من سامسونگ خوب عمل کرده. فریم دور گوشی روی قاب پشت گوشی آمده و روی آن سه دوربین زیر هم قرار گرفته است و فلش هم روی قاب پلاستیکی گوشی قرار دارد و جدا از دوربین ها است.
جنس بدنه پشتی پلاستیک است و این ویژگی خوبی نیست چون امکان خش پذیری آن افزایش پیدا می کند ولی قاب آن طراحی مات جذابی دارد و اثر انگشت هم کم روی آن می ماند.
دور گوشی فریم آلومینیمی است. زیر گوشی درگاه تایپ سی، خشاب سیم کارت، اسپیکر و میکروفون قرار دارد. لبه سمت راست آن دکمه پارو و دکمه کم و زیاد کردن صدا قرار دارد، بالای گوشی هم میکروفون قرار دارد و لبه سمت چپ هم چیزی وجود ندارد. دوربین اصلی سه لنز 12 مگاپیکسل که لنز اصلی است، 64 مگاپیکسل لنز تله فوتو و 12 مگاپیکسل لنز اولترا واید آن است.
عملکرد دوربین با S20 فرقی نداشته و دوربین اصلی آن عملکرد حدودا 10 درصد بهتر از S20 دارد. در نور خوب عکس های خوبی می توان ثبت کرد. شارپ نس آن خیلی زیاد نیست. اگر هم روی سوژه خود زوم کنید جزئیات خیلی خوب به نمایش گذاشته نمی شوند. داینامیک رنج آن معمولی و بعضی مواقع رو به پایین است. درشب هم کفیت آنچنانی ندارد.
لنز تلف فوتو هم خوب عمل می کند و سوژه از بک گراند راحت جدا می شود. لنز اولترا واید هم خوب عمل می کند.
فیلم برداری آن 8K با سرعت 24 فریم بر ثانیه است و کیفیت 4K هم سرعت 60 فریم بر ثانیه است. همه لنز ها قابلیت فیلم برداری 4K با سرعت 60 فریم بر ثانیه را ندارند و فقط با لنز اصلی می توان این کار را انجام داد. در کل این گوشی ارزش خرید را دارد`,
    Specifications: {
      screenSize: "سایز صفحه نمایش / 	6.2 اینچ",
      cpu: `پردازنده / 	Exynos 2100 & Qualcomm SM8350 Snapdragon 888 5G`,
      speaker: "اسپیکر / استریو ( دوگانه )",
      ram: "رم / 8 گیگابایت رم",
      camera: "دوربین اصلی / 12 مگاپیکسل",
      storage: "حافظه داخلی / 256 گیگابایت",
      battery: "باتری / 4000 میلی آمپر ساعت",
    },
    comments: [
      {
        star: 5,
        userName: "علیرضا",
        date: "پنجشنبه 5 آذر 1400",
        text: "یه روز میخرمت جذاب لنعتی !",
        like: 10,
        dislike: 1,
        positivePoints: ["باطری عالی", "دوربین فوق العاده"],
        negativePoints: ["خیلی گرونه"],
        reply: "انشالله عزیز 🙏🌹",
      },
      {
        star: 4,
        userName: "محمد مهدی",
        date: "سه شنبه 5 آبان 1400",
        text: "من گرفتم فوق العادست... \n ممنون از سایت و ارسال سریع شما",
        like: 7,
        dislike: 2,
        positivePoints: ["صفحه نمایش خفن", "جذاب"],
        negativePoints: ["قیمت بالا"],
        reply: "مبارکتون باشه ",
      },
      {
        star: 3,
        userName: "آیدا رضایی",
        date: "جمعه 17 دی 1400",
        text: "من سفارش دادم ولی هنوز دستم نرسیده :(",
        like: 12,
        dislike: 4,
        reply: "صبور باشید فردا دستتون میرسه آیدای عزیز",
      },
    ],
  },
  {
    id: 4,
    quantity: 1,
    category: "phones",
    title: "موبایل شیائومی مدل Poco M4",
    price: 6799000,
    imageURL: xiaomiPocoM4,
    technicalCheck: `باید اعتراف کنیم که پوکو ام 4 پرو 5G بسیار جذاب است. قاب پشتی نسبتاً منحنی به همراه پوشش پلاستیکی مات و ترکیب رنگ خاکستری تیره در کنار برآمدگی مشکی رنگ دوربین و محل درج لوگوی پوکو (خیره‌کننده ولی عجیب)، بی‌شک چشم‌نواز خواهند بود. می‌توانیم بگوییم که پوشش مات به کار رفته روی قاب پشتی کیفیت بسیار بالایی دارد زیرا وقتی آن را لمس می‌کنید احساس فوق‌العاده‌ای به شما منتقل خواهد کرد و این‌گونه حس خواهید کرد که به جای پلاستیک، در حال لمس شیشه هستید.
پنل پشتی خاکستری تیره بسیار دوست‌داشتنی است ولی در عین حال اثرات انگشت و آلودگی‌ها را به سرعت جذب می‌کند و پس از گذشت تنها چند دقیقه کثیف می‌شود. اگر نمی‌خواهید این اتفاق رخ دهد، شاید بهتر باشد سراغ نمونه‌های آبی یا زرد رنگ این موبایل بروید که آنها هم در بالای قاب پشتی خود قسمت مشکی برآمده را دارند.
به غیر از نمایان بودن هویت پوکو در قاب پشتی، Poco M4 Pro 5G در قاب شیشه‌ای و جلویی خود از محافظ گوریلا گلس بهره می‌برد و فریم و قاب آن پلاستیکی هستند. این موبایل تأییدیه رسمی ضد خاک و قطرات آب IP53 دارد که یک عایق عالی به شمار می‌رود. این یعنی پوکو ام 4 پرو 5G مشکلی با آب و هوای مرطوب شهرهای کنار دریا و یا آب و هوای بارانی ندارد ولی نباید در زیر آب فرو برود.
نمای جلویی محل جای‌گیری صفحه نمایش 6.6 اینچی است که در مقایسه با نمایشگر 6.5 اینچی پوکو M3 Pro 5G به میزان 0.1 اینچ بزرگتر شده است. این پنل جدید در بالای خود از همان حفره سیاه رنگ برای حضور یافتن دوربین سلفی بهره می‌برد ولی این‌بار با پشتیبانی از فضای رنگی DCI-P3 و موتور حساس به لمس 240 هرتزی، بروزتر شده است. نمایشگر گوشی مورد بحث ما از نرخ بازسازی 90 هرتزی پویا، فضای رنگی DCI-P3 و موتور حساس به لمس 240 هرتزی پشتیبانی می‌کند. Poco M3 Pro 5G هم نرخ نوسازی 90 هرتزی داشت اما موتور حساس به لمس آن 180 هرتزی و با فضای رنگی sRGB سازگار بود.
در این تلفن همراه خبری از پشتیبانی از کیفیت تصاویر HDR نیست هرچند انتظار چنین چیزی هم نمی‌رفت.
شیائومی عنوان کرده که روشنایی معمول این محصولش به 450 نیت خواهد رسید. در زمانی که خودتان به صورت دستی روشنایی را تنظیم می‌کنید، مقدار آن به 410 نیت می‌رسد و وقتی هم که حالت اتوماتیک در زیر نور خورشید را روشن کردید، رکورد 510 نیتی ثبت خواهد شد. در هر دو حالت، قسمت‌های مشکی عمق زیادی دارند تا کنتراست نهایی ثبت شده 1500:1 باشد.
حداقل روشنایی ثبت شده در قسمت‌های سفید رنگ هم تنها 1.3 نیت بود.
رابط کاربری MIUI مخصوص گوشی‌های پوکو، دو گزینه برای نرخ بازسازی دارد که یکی High با سرعت 90 هرتزی و دیگری Standard با سرعت 60 هرتزی است. مورد اول را بعضاً پویا هم می‌نامند زیرا با توجه به محتوای در حال پخش، به طور اتوماتیک میان سرعت‌های 50، 60 و 90 هرتزی سوئیچ می‌کند.
این‌گونه حدس می‌زنیم که هنگام اسکرول کردن در رابط کاربری سرعت نرخ بازسازی به 90 هرتز برسد و وقتی هم کاری صورت نمی‌گیرد، سرعت آن به 50 هرتز کاهش یابد. همین اتفاق برای محتواهای ثابت در اپلیکیشن‌های سازگار نیز رخ خواهد داد. سرعت 60 هرتزی هم در بازی‌ها و نرم‌افزارهای پخش آنلاین فیلم و استریمینگ فعال خواهد شد. متأسفانه نمی‌توانیم این قضایا را تأیید کنیم زیرا نشانگر اختصاصی نرخ بازسازی، حتی وقتی عکس نمایش داده می‌شود نیز همیشه سرعت 90 هرتزی را نشان می‌دهد. تنها استثنائات قائل شده، سرعت 60 هرتزی برای نرم‌افزارهای مدیریت فایل‌ها، بازی‌ها و برخی از اپلیکیشن‌های پخش فیلم نظیر Mi Video و نتفلیکس می‌باشد. پوکو ام 4 پرو 5G از جدیدترین نسخه رابط کاربری MIUI یعنی شماره 12.5 مخصوص گوشی‌های پوکو بهره می‌برد. دوازدهمین ورژن پوسته نرم‌افزاری محصولات شیائومی مدتی است منتشر شده و اگرچه بر پایه اندروید 11 می‌باشد ولی نمی‌توان به راحتی متوجه این نکته شد. لانچر پوکو دارای تم سیستمی و آیکون‌های متفاوت است ولی اگر دوست داشتید، می‌توانید ظاهرش را آن‌طور که می‌خواهید، تغییر دهید. Poco M4 Pro 5G یک گوشی همه چیز تمام است و دقیقاً همان‌گونه عمل می‌کند که از آن انتظار داریم. به خاطر نمایشگر LCD با نرخ بازسازی 90 هرتزی، سیستم عامل آن روان بوده و می‌تواند در صورت نیاز برخی از بازی‌ها را اجرا کند. تصاویر خوبی هم می‌گیرد و صداها را با کیفیت استریو پخش می‌کند و دوام باتری طولانی مدتی داشته و سرعت شارژش هم زیاد است.`,
    Specifications: {
      cpu: `پردازنده / Mediatek Helio G96 / Mali-G57 MC2`,
      screenSize: "سایز صفحه نمایش / 	6.63 اینچ",
      speaker: "اسپیکر / استریو ( دوگانه )",
      ram: "رم / 8 گیگابایت رم",
      camera: "دوربین اصلی / 50 مگاپیکسل",
      storage: "حافظه داخلی / 128 گیگابایت",
      battery: "باتری / 5000 میلی آمپر ساعت",
    },
    comments: [
      {
        star: 5,
        userName: "بهمن سلطانی",
        date: "شنبه 2 اسفند 1400",
        text: "گوشی خوبیه یشنهاد میکنم",
        like: 32,
        dislike: 10,
        positivePoints: ["باتری عالی", "دوربین قوی"],
        negativePoints: ["وزن زیاد"],
        reply: "ممنون که تجربه خودتون رو باما درمیون گذاشتید ❤🌹",
      },
      {
        star: 5,
        userName: "سارینا",
        date: "سه شنبه 17 دی 1400",
        text: "مقرون به صرفه و اقتصادی هست پیشنهاد میکنم عزیزان",
        like: 15,
        dislike: 1,
        positivePoints: ["قدرت بالا"],
        negativePoints: ["یکم سنگینه"],
        reply: "سپاس از نظر ارزشمند شما 🌹",
      },
      {
        star: 4,
        userName: "احسان حبیبی",
        date: "یکشنبه 20 آبان 1400",
        text: "من سفارش دادم و سریع هم به دستم رسید تشکر از سایت خوب شما",
        like: 12,
        dislike: 4,
        reply: "مبارکتون باشه احسان جان",
      },
    ],
  },
  {
    id: 5,
    quantity: 1,
    category: "phones",
    title: "موبایل سامسونگ Galaxy A51",
    price: 8200000,
    imageURL: galaxyA51,
    technicalCheck: `طبق آمارهای ارائه شده توسط موسسه‌های تحقیقاتی، Galaxy A51 تا اینجای سال 2020، پرفروش‌ترین گوشی اندرویدی جهان است. امروز با بررسی گلکسی A51 سامسونگ قصد داریم دلیل این موضوع را کشف کنیم.
سامسونگ در سال 2019 گوشی‌های سری گلکسی A را دستخوش تغییراتی اساسی کرد، اما شاید خوشبین‌ترین طرفدار این برند هم انتظار اینچنین استقبالی را از گوشی‌های نسل جدید این سری نداشت. گوشی‌های کهکشانی اقتصادی و میان‌رده A در سال گذشته فروش بسیار خوبی در سراسر جهان داشتند و همین فروش خوب نشان‌دهنده این بود که سامسونگ مسیر درستی را برای گوشی‌های میان‌رده خود در پیش گرفته است.
سامسونگ در اوایل سال 2019 گوشی گلکسی A50 را معرفی و راهی بازار کرد. A50 یکی از بهترین گوشی‌های اقتصادی سامسونگ به حساب می‌آمد که به دلیل ارائه امکانات خوب، قیمت مناسب و در عین حال طراحی جذاب با استقبال خوبی از سمت کاربران روبه‌رو شد. این موضوع کار را برای جانشین آن بسیار سخت می‌کرد. با این حال، سامسونگ با معرفی گلکسی A51 ثابت کرد که چرا عنوان “پرفروشترین برند گوشی” در جهان را به خود اختصاص داده است. A51 از نظر مشخصات سخت‌افزاری و حتی طراحی تفاوت چندانی با برادر بزرگتر خود ندارد. اما ظاهراً همین تغییرات کوچک کافیست تا این گوشی حتی از نسل قبل خود نیز موفق‌تر عمل کند و به پرفروش‌ترین گوشی اندرویدی بازار تبدیل شود. در بررسی گلکسی A51 سامسونگ تصمیم داریم تا نگاه دقیق‌تری داشته باشیم به مشخصات این گوشی و ببینیم که چه مشخصه‌هایی آن را به این سطح از محبوبیت در بازار رسانده است. پس با ما همراه باشید. سامسونگ مانند سال گذشته این گوشی را از ترکیب شیشه و پلاستیک طراحی کرده است. قاب پشت و فریم دور این گوشی پلاستیکی است با این تفاوت که خطوط مورب و هاشور مانندی در قاب پشتی آن طراحی شده که در زوایای مختلف و شرایط نوری متفاوت جلوه‌های رنگی متنوع و زیبایی خواهد داشت.
در سمت چپ بالای قاب پشت یک محفظه نسبتاً بزرگ مستطیلی برای دوربین‌ها در نظر گرفته شده است. در ستون سمت چپ سه سنسور دوربین و در ستون سمت راست این قاب فلش LED و یک سنسور دوربین دیگر جای گرفته‌اند. برآمدگی این قسمت از قاب نسبت به برجستگی قاب دوربین گوشی‌های مشابه آنقدر محسوس نیست و قرار دادن آن بر روی سطح صاف و کار کردن با گوشی را با  مشکل مواجه نخواهد کرد. اما از آنجاییکه قاب دستگاه پلاستیکی است، به شدت مستعد جذب خراش بوده، از همین رو بهتر است از قاب محافظی که درون جعبه گوشی در نظر گرفته شده، استفاده کنید. نمایشگر و پنل جلوی گوشی با پوشش گوریلا گلس 3 محافظت می‌شوند و این یعنی این یعنی مقاومت نمایشگر در مقایسه با قاب پشتی در برابر خط و خراش بیشتر است، البته نه در آن حدی که به طور کل قید استفاده از محافظ و گلس را بزنید. در مقایسه با A50 حاشیه‌های اطراف نمایشگر A51 باریک‌تر شده‌اند و دوربین سلفی از ناچ به حفره‌ای دورن نمایشگر منتقل شده است. گلکسی A51 سامسونگ یکی از جمع و جورترین و خوش‌دست‌ترین گوشی‌هایی است که در این بازه قیمتی راهی بازار شده است. این گوشی به‌ طرز جالبی سبک‌تر و باریک‌تر از رقیبان خود طراحی شده و استفاده طولانی مدت از آن حتی برای دستان ظریف نیز خسته‌کننده نخواهد بود. وجود جک 3.5 میلیمتری هدفون، شیار اختصاصی کارت حافظه و قاب محافظ در جعبه نیز از نکات مثبتی است که سامسونگ در طراحی این دستگاه آنها را مد نظر داشته است. گلکسی A51 سامسونگ از چیپست 10 نانومتری اگزینوس 9611 به عنوان مغز متفکر بهره می‌برد. این تراشه دارای پردازنده هشت هسته‌ای (4 هسته 2.3 گیگاهرتزی Cortex-A73 و 4 هسته 1.7 گیگاهرتزی Cortex-A53) با پردازنده گرافیکی Mali-G72 MP3 بهره می‌برد. سامسونگ این گوشی را با 4 پیکربندی با 4، 6 و 8 گیگابایت حافظه رم و 64 و 128 گیگابایت حافظه ذخیره‌سازی از نوع UFS 2.0 راهی بازار کرده است. خوشبختانه در تمامی نسخه‌های این گوشی امکان افزایش حافظه از طریق شیار اختصاصی microSD نیز در نظر گرفته شده است.
در مقایسه با چیپست اگزینوس 9610 که در گوشی A50 استفاده شده، در 9611 تفاوت چشمگیری مشاهده نمی‌شود. هسته‌های پردازنده، فرکانس آنها و حتی پردازنده گرافیکی آنها نیز یکی است. به نظر می‌رسد تفاوت تفاوت اعمال شده در دوربین باشد که امکان پشتیبانی از سنسورهای با رزولوشن بالاتر در نظر گرفته شده است. با این حال، در تست‌های بنچمارک در بررسی گلکسی A51 سامسونگ امتیازاتی که توسط این گوشی کسب شد، تقریباً در تمامی تست‌ها بهتر از نسل قبلی خود بود. A51 یک گوشی میان‌رده است و این یعنی در انجام کارهای روزمره مانند استفاده از شبکه‌های اجتماعی، عکاسی، فیلمبرداری، یوتیوب، گشتن در وبسایت‌ها، برقراری تماس، ارسال پیام، مطالعه و … به هیچ وجه شما را ناامید نخواهد کرد. البته امکان استفاده از این گوشی برای انجام کارهای سنگین و چالشی‌تر نیز در نظر گرفته شده. به عنوان مثال در طول بررسی گلکسی A51 سامسونگ ما توانستیم جدیدترین و سنگین‌ترین بازی‌های موبایلی مانند آسفالت 9 یا PUBG Mobile را بر روی آن نصب کنیم و با موفقیت بازی کنیم.`,
    Specifications: {
      speaker: "اسپیکر / مونو",
      ram: "رم / 6 گیگابایت رم",
      camera: "دوربین اصلی / 48 مگاپیکسل",
      storage: "حافظه داخلی / 128 گیگابایت",
      battery: "باتری / 4000 میلی آمپر ساعت",
    },
    comments: [
      {
        star: 5,
        userName: "علی بیرانوند",
        date: "شنبه 26 بهمن 1400",
        text: "من برای روز پدر سفارش دادم گوشی فوق العاده ای هست... تشکر از شما✨",
        like: 20,
        dislike: 1,
        positivePoints: ["جذابه", "باتریش خوبه"],
        reply: "مبارک باشه علی جان به خوشی استفاده کنن انشالله ❤🌹",
      },
      {
        star: 4,
        userName: "الهام جلیل وند",
        date: "دوشنبه 5 خرداد 1400",
        text: "من سفارش دادم هنوز به دستم نرسیده :(",
        like: 10,
        dislike: 3,
        reply: "بابت تاخیر از شما معذرت میخوایم مرسی که صبور هستید 💖",
      },
      {
        star: 5,
        userName: "آقا علی",
        date: "یکشنبه 20 آبان 1400",
        text: "میخرم به زودی 🙂",
        like: 12,
        dislike: 5,
        reply: "درخدمت شما هستیم💖🙏",
      },
    ],
  },
  {
    id: 7,
    quantity: 1,
    category: "AIRPODS",
    title: "هدفون بی سیم AirPods Pro",
    price: 5795000,
    imageURL: airpodsPro,
    Specifications: {
      speaker: "نوع اتصال / بی سیم",
      ram: "رنگ / سفید",
      camera: "میکروفون / دارد ",
      storage: "کنترل کننده صدا / دارد",
      battery: "طریقه شارژ / از طریق محفظه",
    },
  },
  {
    id: 8,
    quantity: 1,
    category: "consoles",
    title: "کنسول بازی Play Station 5",
    price: 22399000,
    imageURL: ps5,
    technicalCheck: `سونی در مقایسه با مایکروسافت، رفتار محتاط‌تری در قبال معرفی پلی استیشن 5 داشت. هرچند خبر ساخته شدن کنسول از مدت‌ها قبل اعلام شده بود، اما درحالی‌که از زمان مراسم The Game Awards 2019 با ظاهر ایکس باکس سری ایکس آشنا شده بودیم، سونی اولین‌بار خرداد سال گذشته و در جریان رویدادی که هدفش معرفی بازی‌های این کنسول بود، رسما از ظاهر پلی استیشن 5 رونمایی کرد. پلی استیشن 5 در دو مدل معمولی و دیجیتالی رونمایی شد که تنها تفاوت آن‌ها، به پشتیبانی از دیسک‌های فیزیکی مربوط می‌شود و درحالی‌که خریداران مدل معمولی امکان تجربه بازی‌های فیزیکی را خواهند داشت، مدل دیجیتال فاقد این ویژگی خواهد بود و به همین دلیل قیمت پایین‌تری هم دارد که در ادامه بیشتر از آن خواهیم گفت.  پلی استیشن ۵ فعلا در مدلی با رنگ غالب سفید معرفی شده است. قسمت‌های کناری کنسول کاملا سفید رنگ هستند و در وسط آن‌ها، شاهد قسمتی مشکی‌رنگ هم هستیم که در زمان روشن بودن کنسول، نوار باریکی از نور آبی رنگ هم در طرفین این قسمت دیده می‌شود. پلی استیشن 5، سه پورت USB-A دارد که یک عدد از آن‌ها در قسمت جلوی کنسول و دو عدد دیگر هم در پشت آن قرار دارند. همینطور یک پورت USB-C هم در قسمت جلوی کنسول تعبیه شده و پورت LAN و HDMI هم در پشت کنسول قرار دارند.  اولین وسیله، دوربین پلی استیشن 5 است که HD Camera نام دارد و با داشتن دو لنز 1080p، وسیله‌ای شدیدا کاربردی برای استریمر‌ها خواهد بود. درکنار دوربین، نسل جدید هدست‌های سونی هم برای پلی استیشن ۵ معرفی شده که Pulse 3D نام دارد. این هدست بی‌سیم، در راس تمام ویژگی‌هایش از صدای سه‌بعدی پشتیبانی می‌کند که سونی تا امروز مانور زیادی روی تاثیرگذاری آن در بازی‌ها داشته و اعلام کرده که این ویژگی، باعث خواهد شد تا کاربران بیشتر از هر زمان دیگری غرق تجربه بازی شوند. هدست جدید سونی همینطور از میکروفونی با پشتیبانی از نویز کنسلینگ استفاده می‌کند تا با حذف صداهای اضافی اطراف، صدای شما را به‌صورت شفاف و دقیق منتقل کند. 
یک ریموت به اسم Media Remote که برای کنترل محتوای صوتی و تصویری کاربرد دارد و از یک میکروفون داخلی هم برای دریافت فرمان‌های صوتی استفاده می‌کند و همینطور پایه مخصوص شارژ دسته‌ها هم دیگر لوازمی هستند که برای PS5 عرضه شده‌اند. پلی استیشن ۵ همزمان با عرضه جهانی در ایران نیز عرضه شد و این روز‌ها هر دو مدل دیجیتال و فیزیکی آن قیمتی بالاتر از ۲۰ میلیون دارند. این مساله البته کاملا ناشی از اتفاقات داخلی نیست و به دلیل کمبود موجودی جهانی کنسول، حتی در برخی کشور‌های دیگر هم خرید آن با قیمت ۵۰۰ و ۴۰۰ دلار ممکن نیست و بخشی از غیرمتعارف بودن قیمت داخلی هم همین مساله است. انتظار می‌رود در آینده و با بهبود وضعیت میزان عرضه جهانی، قسمت کنسول در داخل کشور هم به قیمت معادل دلاری آن نزدیک‌تر شود. هرچند که به‌هیچ وجه نمی‌توان پیش‌بینی دقیقی در این مورد داشت. سته پلی استیشن ۵ بزرگ‌تر و سنگین‌تر از دسته پلی استیشن ۴ است که البته به‌نظر می‌رسد به‌لطف همین ویژگی‌ها و صد البته توجه به طراحی ارگونومیک، شاهد کنترلر خوش‌دست‌تری در مقایسه با نسل قبل هستیم. هرچند لوگو‌های همیشگی سونی و اشکال هندسی چهارگانه دوست‌داشتنی این شرکت روی کلید‌های دوال سنس هم حک شده‌اند، اما سونی این بار سراغ طراحی آن‌ها به شکل بی‌رنگ رفته که ظاهر خاصی به این کنترلر سفید‌رنگ بخشیده است. سونی اخیرا به صورت رسمی دسته PS5 مشکی و دسته PS5 قرمز را نیز معرفی کرده است که به ترتیب با قیمت ۷۰ و ۷۵ دلار عرضه می‌شوند. 
علاوه بر موارد ظاهری، دوال سنس قرار است از نظر عملکرد هم تجربه‌ای نسل نهمی ارائه کند. جدا از اینکه این دسته باتری بهتری در مقایسه با دوال‌شاک ۴ خواهد داشت و شاهد پورت USB-C هم روی آن خواهیم بود، سونی بافت کلی دسته را چه در بدنه خود آن و چه در مواردی مثل آنالوگ‌ها و تریگر‌ها به‌شکلی طراحی کرده که دسته راحت‌تر از نسل قبلی دسته‌های سونی در دست قرار بگیرد. همچنین حساسیت بالاتر تریگر‌ها، یکی دیگر از مواردی است که نتیجه آن، تاثیرگذاری به مراتب بیش‌تر فشار وارد‌شده به تریگر در اعمال دستور‌ها در بازی خواهد بود. سونی این مورد را به کشیدن زه یک کمان تشبیه کرده که شما می‌توانید با فشار دلخواه، آن را به میزان دلخواه بکشید. البته این مورد خیلی هم ویژگی جدیدی نیست و قبلا هم در بازی‌ها استفاده شده بود ولی خب قرار است دقت آن در دوال سنس به مراتب بیش‌تر باشد. `,
    Specifications: {
      cpu: "پردازنده / 8 هسته ای ذن",
      ram: "حافظه رم / 16 گیگابایت رم",
      camera: "خروجی تصویر / 4K , 8K",
      storage: "حافظه داخلی / 825 گیگابایت",
      Weight: "وزن / 4.5 کیلوگرم",
    },
    comments: [
      {
        star: 5,
        userName: "پارسا رضایی",
        date: "پنجشنبه 8 بهمن 1400",
        text: "اگه قصد خرید دارید کنسول فوق العاده ای هست... راضیتون میکنه!",
        like: 20,
        dislike: 5,
        positivePoints: ["کیفیت عالی"],
        negativePoints: ["قیمت بالاست"],
        reply: "بله کنسول خوبی هست",
      },
      {
        star: 4,
        userName: "سارا",
        date: "سه شنبه 5 آبان 1400",
        text: "هرکی گرفته خوشبحالش :)",
        like: 7,
        dislike: 1,
        positivePoints: ["جذاب لعنتیه"],
        negativePoints: ["قیمت بالا"],
        reply: "انشالله شماهم میگیرید عزیز",
      },
      {
        star: 5,
        userName: "مژده حبیبی",
        date: "شنبه 17 اسفند 1400",
        text: "بزودی سفارش میدم",
        like: 5,
        dislike: 4,
        reply: "💜🌹",
      },
    ],
  },
  {
    id: 9,
    quantity: 1,
    category: "consoles",
    title: "کنسول بازی Xbox Seires s",
    price: 10170000,
    imageURL: xboxSeriesS,
    Specifications: {
      cpu: "پردازنده / شخصی سازی شده Zen2",
      ram: "حافظه رم / 10 گیگابایت رم",
      camera: "خروجی تصویر / QHD",
      storage: "حافظه داخلی / 500 گیگابایت SSD",
      Weight: "وزن / 1.93 کیلوگرم",
    },
  },
  {
    id: 12,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Asus ROG Strix",
    price: 39648000,
    imageURL: asusRogStrix,
    technicalCheck: `شاید در میان انبوه لپ‌تاپ‌های گیمینگ ایسوس که در بین آن‌ها محصولات پرقدرتی همچون Strix Scar یا سری Zephyrus S با سخت‌افزار دیوانه‌وار و برچسب‌های قیمتی نجومی‌شان نگاه‌ها را به خود خیره می‌کنند، دستگاه‌های سری Strix G کمتر به‌چشم بیایند؛ اما امسال به‌لطف عملکرد شگفت‌انگیز پردازنده‌‌‌ی Ryzen 9 5900HX در دل لپ‌تاپ‌های جدید Strix G513، وضعیت کمی به سود خانواده‌ی میان‌رده‌ی Strix G تغییر کرده است.
لپ‌تاپ‌های Strix G513 چندین عضو با پردازنده‌های Ryzen 9 5900HX و Ryzen 7 4800H به‌همراه گرافیک‌های RTX 3050، RTX 3060 و RTX 3070 وجود دارد؛ اما شاید جذاب‌ترین و ارزشمندترین مدل در میان آن‌ها، یکی از مدل‌های میانی موسوم به Strix G513QM با پردازنده‌ی پرقدرت Ryzen 9 و گرافیک RTX 3060 باشد. این لپ‌تاپ به‌ویژه در نسخه‌ی Full-HD در ترکیب با باتری بسیار حجیم ۹۰ وات‌ساعتی‌اش، حداقل روی کاغذ، جزو معدود لپ‌تاپ‌های گیمینگی به‌شمار می‌آید که حداقل در کاربری‌های روزمره، می‌توان به «قابلیت حمل» آن اتکا داشت. دریایی از نورپردازی رنگارنگ RGB، لوگوی براق ROG و تضاد رنگی بدنه؛ تایوانی‌ها با زبان طراحی Strix G15 به بهترین شکل ممکن به هدف خود در جلب توجه گیمرها می‌رسند؛ تقریبا تمام خوره‌های بازی در زومیت و زومجی، همین نظر را در مورد Strix G15 داشتند. ایسوس لپ‌تاپ Strix G15 را در سه گزینه‌ی رنگی Stealthy Original Black و Eclipse Gray و Electro Punk به‌فروش می‌رساند که مورد نخست و دوم با تضادهای رنگی مشکی و قرمز برای کاربران جوان‌تر و مورد دوم با تضاد رنگی مشکی/خاکستری برای گیمرهای جاافتاده‌تر انتخاب مناسبی به‌شمار می‌آیند. علاوه‌بر نورپردازی مجزای هرکدام از کلیدهای کیبورد، نواری از چراغ‌های LED در سه لبه‌ی Strix G15 نیز وجود دارد. شما می‌توانید جلوه‌ی نورپردازی هرکدام از نواحی RGB را با تنظیمات Aura Sync در نرم‌افزار Armoury Crate ایسوس، به‌دلخواه خود شخصی‌سازی کنید. ما وجود نوار LED در لبه‌های لپ‌تاپ را چندان جالب نمی‌دانیم؛ اما جامعه‌ی مخاطبان این لپ‌تاپ که گیمرها هستند، با ما هم‌نظر نباشند. متأسفانه نورپردازی نوار LED اطراف لپ‌تاپ و کلیدهای کیبورد مستقل از هم نیستند و برای خاموش‌کردن آن باید نور پس‌زمینه‌ی کیبورد را خاموش کنید. طراحان ایسوس قاب پشتی نمایشگر و لولاهای Strix G15 را از جنس فلز و باقی بدنه را از جنس پلاستیک انتخاب کرده‌اند؛ البته نباید مأیوس باشید؛ چرا‌که دستگاه کیفیت ساخت بسیار بالایی دارد و به هیچ‌وجه حس‌وحال کالایی ارزان‌قیمت یا بی‌کیفیت را القا نمی‌کند. ایسوس می‌گوید استفاده از پلاستیک در محل استراحت دست از انتقال حرارت به دستان کاربر جلوگیری می‌کند. Strix G15 با وزن ۲٫۳۰ کیلوگرمی‌اش به‌اندازه‌ی اولترابوک‌های سبک‌وزن یک کیلوگرمی قابل‌حمل نیست؛ اما باتوجه به قدرت پردازشی فوق‌العاده و نمایشگر ۱۵٫۶ اینچی‌اش، می‌توانیم از سنگینی وزنش چشم‌پوشی کنیم. 
با باز کردن درِ لپ‌تاپ، با حاشیه‌های بسیار باریک کناری و بالایی صفحه‌‌نمایش ماتِ Strix G15، نوشته‌های ریز ROG‌ در گوشه‌‌ای از پایه، ترک‌پد بسیار بزرگ و نورپردازی RGB کیبورد مواجه خواهید شد. تایوانی‌ها ابعاد نسل جدید Strix G15 را ۷ درصد کاهش داده‌اند و با باریک‌تر کردن حاشیه‌ها، نسبت صفحه‌نمایش به بدنه را به عدد بسیار خوب ۸۵ درصد رسانده‌اند. ای کاش ایسوس به‌جای استفاده از نمایشگر عریضِ ۱۶:۹، پنل بلندتری با نسبت تصویر ۳:۲ یا ۱۶:۱۰ به‌کار می‌برد تا ضخامت حاشیه‌ی قطور پایین نیز کاهش یابد. ایسوس لپ‌تاپ Strix G15 G513QM را با یکی از دو پنل ۱۵٫۶ اینچی QHD و Full-HD به‌فروش می‌رساند؛ هر دو پنل از نوع IPS با زمان پاسخگویی ۳ میلی‌ثانیه‌ای هستند؛ اما نمونه‌ی QHD فضای وسیع DCI-P3 را به‌صورت کامل پوشش داده و نرخ نوسازی ۱۶۵ هرتزی را ارائه می‌دهد، درحالی‌که نمونه‌ی Full-HD از نرخ نوسازی ۳۰۰ هرتزی را دراختیارتان می‌گذارد و پوشش کاملی از فضای رنگی sRGB دارد. متأسفانه گرافیک یکپارچه‌ی موجود در تراشه‌ی Ryzen 9 5900HX به‌جای معماری جدید RDNA2 از ۸ هسته‌ی پردازشی با معماری قدیمی Vega و فرکانس بیشینه‌ی ۲۱۰۰ مگاهرتز استفاده می‌کند. طبیعتا ایسوس به این ماژول اکتفا نکرده و لپ‌تاپ گیمینگ خود را به گرافیک مجزای NVIDIA RTX 3060 مجهز کرده است.
انویدیا گرافیک RTX 3060 نسخه‌ی موبایل را در ۱۱ مدل مختلف با فرکانس‌های متفاوت و توان مصرفی ۶۰ تا ۱۱۵ وات دراختیار تولیدکنندگان قرار می‌دهد؛ ایسوس قدرتمندترین نمونه‌ی موجود را با توان مصرفی ۱۱۵ وات در لپ‌تاپ Strix G15 به‌کار می‌گیرد و می‌گوید به‌کمک فناوری Dynamic Boost، هنگام اتصال لپ‌تاپ به پریز برق، توان بالغ‌بر ۱۳۰ وات را نیز به این گرافیک اختصاص می‌دهد.
پردازنده‌ی گرافیکی ۱۱۵ واتی RTX 3060 با فرکانس پایه‌ی ۱۳۸۷ مگاهرتز از ۳۸۴۰ هسته‌ی Cuda بهره می‌برد، حافظه‌ی ۶ گیگابایتی GDDR6-اش با باس ۱۹۲ بیتی و فرکانس ۱۷۵۰ مگاهرتزی به پهنای باند ۳۳۶ گیگابایت‌برثانیه دست می‌یابد و توان محاسباتی آن با دقت FP32 به ۱۰٫۷ ترافلاپس می‌رسد که روی کاغذ از سطح عملکرد گرافیک پرقدرت RTX 2070 Super بسیار فراتر است. از بین انبوه لپ‌تاپ‌های گیمینگ بازار، Strix G513QM یکی از معدود مدل‌هایی به‌شمار می‌آید که مجموعه‌ای از قطعات توانمند را با نقص‌های اندک کنار هم آورده است. پردازنده‌ی پرقدرت Ryzen 9 5900HX چه در حالت Plugged، چه Unplugged عملکرد کم‌نظیری را با پایداری بسیار خوب ارائه می‌دهد، نسخه‌ی ۱۱۵ واتی RTX 3060 در ترکیب با نمایشگر ۳۰۰ هرتزی دستگاه، امکان اجرای مطلوب عموم بازی‌ها را فراهم می‌کند و اسپیکرها با تفکیک بسیار خوب صدا و بیس‌های عمیق، تجربه‌ی موسیقایی لذت‌بخشی را ارائه می‌دهند.`,
    Specifications: {
      cpu: "پردازنده / اینتل core i7",
      ram: "حافظه رم / 32 گیگابایت رم",
      gpu: "گرافیک / انویدیا GTX 1650Ti",
      storage: "حافظه داخلی / 1 ترابایت",
      Weight: "وزن / 2.39 کیلوگرم",
    },
    comments: [
      {
        star: 5,
        userName: "محمدرضا",
        date: "دوشنبه 8 آذر 1400",
        text: "فوق العادست دوستان !",
        like: 15,
        dislike: 2,
        positivePoints: ["رنگارنگ و باحاله", "قدرت پردازش بالا"],
        negativePoints: ["وزنش یکم سنگینه"],
        reply: "مبارکتون باشه محمدرضای عزیز",
      },
      {
        star: 5,
        userName: "تانیا",
        date: "یکشنبه 5 دی 1400",
        text: "خیلی قشنگه...",
        like: 7,
        dislike: 2,
        positivePoints: ["قدرتمند", "جذاب"],
        reply: "بله همینطوره ",
      },
      {
        star: 5,
        userName: "مجتبی محمدی",
        date: "شنبه 4 دی 1400",
        text: "من سفارش دادم به موقع به دستم رسید تشکر از سایت عالی شما",
        like: 12,
        dislike: 4,
        reply: "خوشحالیم که رضایت دارید 💜",
      },
    ],
  },
  {
    id: 14,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Asus TUF dash F15",
    price: 42899000,
    imageURL: asusTufDashF15,
    Specifications: {
      cpu: "پردازنده / اینتل core i7",
      ram: "حافظه رم / 16 گیگابایت رم",
      gpu: "گرافیک / انویدیا RTX 3060",
      storage: "حافظه داخلی / 1 ترابایت",
      Weight: "وزن / 2 کیلوگرم",
    },
  },
  {
    id: 15,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Asus TUF Gaming F15",
    price: 23899000,
    imageURL: asusGaming,
    Specifications: {
      cpu: "پردازنده / اینتل core i5",
      ram: "حافظه رم / 8 گیگابایت رم",
      gpu: "گرافیک / انویدیا GTX 1650 Ti",
      storage: "حافظه داخلی / 1256 گیگابایت",
      Weight: "وزن / 2.3 کیلوگرم",
    },
  },
  {
    id: 17,
    quantity: 1,
    category: "laptops",
    title: "لپتاپ Lenovo Thinkbook",
    price: 14800000,
    imageURL: thinkBook,
    Specifications: {
      cpu: "پردازنده / اینتل core i5",
      ram: "حافظه رم / 8 گیگابایت رم",
      gpu: "گرافیک / 2 گیگابایت از نوع GDDR5",
      storage: "حافظه داخلی / 1 ترابایت",
      Weight: "وزن / 1.7 کیلوگرم",
    },
  },
];
